bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
/* 
 * Copyright(C) 2012 Robinson Mittmann. All Rights Reserved.
 * 
 * This file is part of the libstm32f.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 3.0 of the License, or (at your option) any later version.
 * 
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 * 
 * You can receive a copy of the GNU Lesser General Public License from 
 * http://www.gnu.org/
 */

/** 
 * @file stm32f-otg_hs.h
 * @brief
 * @author Robinson Mittmann <bobmittmann@gmail.com>
 */ 

#ifndef __STM32F_OTG_HS_H__
#define __STM32F_OTG_HS_H__

/* ------------------------------------------------------------------------- */
/* OTG_HS global registers
These registers are available in both host and peripheral modes, and do not need to be reprogrammed when switching between these modes.
Bit values in the register descriptions are expressed in binary unless otherwise specified. */

/* ------------------------------------------------------------------------- */
/* OTG_HS control and status register */
#define STM32F_OTG_HS_GOTGCTL 0x000

/* The OTG control and status register controls the behavior and reflects the status of the OTG function of the core. 
   */

/* [31..20] Reserved, must be kept at reset value. */


/* Bit 19 - B-session valid */
#define OTG_HS_BSVLD (1 << 19)
/* Indicates the peripheral mode transceiver status.
0: B-session is not valid.
1: B-session is valid.
In OTG mode, you can use this bit to determine if the device is connected or disconnected.
Note: Only accessible in peripheral mode. */

/* Bit 18 - A-session valid */
#define OTG_HS_ASVLD (1 << 18)
/* Indicates the host mode transceiver status.
0: A-session is not valid
1: A-session is valid
Note: Only accessible in host mode. */

/* Bit 17 - Long/short debounce time */
#define OTG_HS_DBCT (1 << 17)
/* Indicates the debounce time of a detected connection.
0: Long debounce time, used for physical connections (100 ms + 2.5 μs)
1: Short debounce time, used for soft connections (2.5 μs)
Note: Only accessible in host mode. */

/* Bit 16 - Connector ID status */
#define OTG_HS_CIDSTS (1 << 16)
/* Indicates the connector ID status on a connect event.
0: The OTG_HS controller is in A-device mode
1: The OTG_HS controller is in B-device mode
Note: Accessible in both peripheral and host modes. */

/* [15..12] Reserved, must be kept at reset value. */


/* Bit 11 - Device HNP enabled */
#define OTG_HS_DHNPEN (1 << 11)
/* The application sets this bit when it successfully receives a SetFeature.SetHNPEnable command from the connected USB host.
0: HNP is not enabled in the application
1: HNP is enabled in the application
Note: Only accessible in peripheral mode. */

/* Bit 10 - Host set HNP enable */
#define OTG_HS_HSHNPEN (1 << 10)
/* The application sets this bit when it has successfully enabled HNP (using the SetFeature.SetHNPEnable command) on the connected device.
0: Host Set HNP is not enabled
1: Host Set HNP is enabled
Note: Only accessible in host mode. */

/* Bit 9 - HNP request */
#define OTG_HS_HNPRQ (1 << 9)
/* The application sets this bit to initiate an HNP request to the connected USB host. The application can clear this bit by writing a 0 when the host negotiation success status change bit in the OTG interrupt register (HNSSCHG bit in OTG_HS_GOTGINT) is set. The core clears this bit when the HNSSCHG bit is cleared.
0: No HNP request
1: HNP request
Note: Only accessible in peripheral mode. */

/* Bit 8 - Host negotiation success */
#define OTG_HS_HNGSCS (1 << 8)
/* The core sets this bit when host negotiation is successful. The core clears this bit when the HNP Request (HNPRQ) bit in this register is set.
0: Host negotiation failure
1: Host negotiation success
Note: Only accessible in peripheral mode. */

/* [7..2] Reserved, must be kept at reset value. */


/* Bit 1 - Session request */
#define OTG_HS_SRQ (1 << 1)
/* The application sets this bit to initiate a session request on the USB. The application can clear this bit by writing a 0 when the host negotiation success status change bit in the OTG Interrupt register (HNSSCHG bit in OTG_HS_GOTGINT) is set. The core clears this bit when the HNSSCHG bit is cleared.
If you use the USB 1.1 full-speed serial transceiver interface to initiate the session request, the application must wait until V BUS discharges to 0.2 V, after the B-Session Valid bit in this register (BSVLD bit in OTG_HS_GOTGCTL) is cleared. This discharge time varies between different PHYs and can be obtained from the PHY vendor.
0: No session request
1: Session request
Note: Only accessible in peripheral mode. */

/* Bit 0 - Session request success */
#define OTG_HS_SRQSCS (1 << 0)
/* The core sets this bit when a session request initiation is successful.
0: Session request failure
1: Session request success
Note: Only accessible in peripheral mode. */


/* OTG_HS interrupt register */
#define STM32F_OTG_HS_GOTGINT 0x04

/* The application reads this register whenever there is an OTG interrupt and clears the bits in this register to clear the OTG interrupt. */

/* [31..20] Reserved, must be kept at reset value. */


/* Bit 19 - Debounce done */
#define OTG_HS_DBCDNE (1 << 19)
/* The core sets this bit when the debounce is completed after the device connect. The application can start driving USB reset after seeing this interrupt. This bit is only valid when the HNP Capable or SRP Capable bit is set in the Core USB Configuration register (HNPCAP
bit or SRPCAP bit in OTG_HS_GUSBCFG, respectively).
Note: Only accessible in host mode. */

/* Bit 18 - A-device timeout change */
#define OTG_HS_ADTOCHG (1 << 18)
/* The core sets this bit to indicate that the A-device has timed out while waiting for the B-device to connect.
Note: Accessible in both peripheral and host modes. */

/* Bit 17 - Host negotiation detected */
#define OTG_HS_HNGDET (1 << 17)
/* The core sets this bit when it detects a host negotiation request on the USB.
Note: Accessible in both peripheral and host modes. */

/* [16..10] Reserved, must be kept at reset value. */


/* Bit 9 - Host negotiation success status change */
#define OTG_HS_HNSSCHG (1 << 9)
/* The core sets this bit on the success or failure of a USB host negotiation request. The application must read the host negotiation success bit of the OTG Control and Status register (HNGSCS in OTG_HS_GOTGCTL) to check for success or failure.
Note: Accessible in both peripheral and host modes. */

/* [7..3] Reserved, must be kept at reset value. */


/* Bit 8 - Session request success status change */
#define OTG_HS_SRSSCHG (1 << 8)
/* The core sets this bit on the success or failure of a session request. The application must read the session request success bit in the OTG Control and status register (SRQSCS bit in OTG_HS_GOTGCTL) to check for success or failure.
Note: Accessible in both peripheral and host modes. */

