bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
/* Bit 2 - Session end detected */
#define OTG_HS_SEDET (1 << 2)
/* The core sets this bit to indicate that the level of the voltage on V BUS is no longer valid for a B-device session when V BUS < 0.8 V. */

/* [1..0] Reserved, must be kept at reset value. */



/* OTG_HS AHB configuration register */
#define STM32F_OTG_HS_GAHBCFG 0x008

/* This register can be used to configure the core after power-on or a change in mode. This register mainly contains AHB system-related configuration parameters. Do not change this register after the initial programming. The application must program this register before starting any transactions on either the AHB or the USB. */

/* [31..20] Reserved, must be kept at reset value. */


/* Bit 8 - Periodic TxFIFO empty level */
#define OTG_HS_PTXFELVL (1 << 8)
/* Indicates when the periodic TxFIFO empty interrupt bit in the Core interrupt register (PTXFE bit in OTG_HS_GINTSTS) is triggered.
0: PTXFE (in OTG_HS_GINTSTS) interrupt indicates that the Periodic TxFIFO is half empty
1: PTXFE (in OTG_HS_GINTSTS) interrupt indicates that the Periodic TxFIFO is completely empty
Note: Only accessible in host mode. */

/* Bit 7 - TxFIFO empty level */
#define OTG_HS_TXFELVL (1 << 7)
/* In peripheral mode, this bit indicates when the IN endpoint Transmit FIFO empty interrupt (TXFE in OTG_HS_DIEPINTx.) is triggered.
0: TXFE (in OTG_HS_DIEPINTx) interrupt indicates that the IN Endpoint TxFIFO is half empty
1: TXFE (in OTG_HS_DIEPINTx) interrupt indicates that the IN Endpoint TxFIFO is completely empty
Note: Only accessible in peripheral mode. */

/* Bit 6 Reserved, must be kept at reset value. */

/* Bit 5 - DMA enable */
#define OTG_HS_DMAEN (1 << 5)
/* 0: The core operates in slave mode
1: The core operates in DMA mode */

/* Bits [4..1] - Burst length/type */
#define OTG_HS_HBSTLEN_MSK (((1 << (4 - 1 + 1)) - 1) << 1)
#define OTG_HS_HBSTLEN_SET(VAL) (((VAL) << 1) & OTG_HS_HBSTLEN_MSK)
#define OTG_HS_HBSTLEN_GET(REG) (((REG) & OTG_HS_HBSTLEN_MSK) >> 1)
/* 0000 Single
0001 INCR
0011 INCR4
0101 INCR8
0111 INCR16
Others: Reserved */

/* Bit 0 - Global interrupt mask */
#define OTG_HS_GINTMSK (1 << 0)
/* This bit is used to mask or unmask the interrupt line assertion to the application. Irrespective
of this bit setting, the interrupt status registers are updated by the core.
0: Mask the interrupt assertion to the application.
1: Unmask the interrupt assertion to the application
Note: Accessible in both peripheral and host modes. */


/* OTG_HS USB configuration register */
#define STM32F_OTG_HS_GUSBCFG 0x00C

/* This register can be used to configure the core after power-on or a changing to host mode or peripheral mode. It contains USB and USB-PHY related configuration parameters. The
application must program this register before starting any transactions on either the AHB or the USB. Do not make changes to this register after the initial programming. */

/* Bit 31 - Corrupt Tx packet */
#define OTG_HS_CTXPKT (1 << 31)
/* This bit is for debug purposes only. Never set this bit to 1.
Note: Accessible in both peripheral and host modes. */

/* Bit 30 - Forced peripheral mode */
#define OTG_HS_FDMOD (1 << 30)
/* Writing a 1 to this bit forces the core to peripheral mode irrespective of the OTG_HS_ID input pin.
0: Normal mode
1: Forced peripheral mode
After setting the force bit, the application must wait at least 25 ms before the change takes effect.
Note: Accessible in both peripheral and host modes. */

/* Bit 29 - Forced host mode */
#define OTG_HS_FHMOD (1 << 29)
/* Writing a 1 to this bit forces the core to host mode irrespective of the OTG_HS_ID input pin.
0: Normal mode
1: Forced host mode
After setting the force bit, the application must wait at least 25 ms before the change takes effect.
Note: Accessible in both peripheral and host modes. */

/* [28..26] Reserved, must be kept at reset value. */


/* Bit 25 - ULPI interface protect disable */
#define OTG_HS_ULPIIPD (1 << 25)
/* This bit controls the circuitry built in the PHY to protect the ULPI interface when the link tri-states stp and data. Any pull-up or pull-down resistors employed by this feature can be disabled. Please refer to the ULPI specification for more details.
0: Enables the interface protection circuit
1: Disables the interface protection circuit */

/* Bit 24 - Indicator pass through */
#define OTG_HS_PTCI (1 << 24)
/* This bit controls whether the complement output is qualified with the internal V BUS valid comparator before being used in the V BUS state in the RX CMD. Please refer to the ULPI specification for more details.
0: Complement Output signal is qualified with the Internal V BUS valid comparator
1: Complement Output signal is not qualified with the Internal V BUS valid comparator */

/* Bit 23 - Indicator complement */
#define OTG_HS_PCCI (1 << 23)
/* This bit controls the PHY to invert the ExternalVbusIndicator input signal, and generate the complement output. Please refer to the ULPI specification for more details.
0: PHY does not invert the ExternalVbusIndicator signal
1: PHY inverts ExternalVbusIndicator signal */

/* Bit 22 - TermSel DLine pulsing selection */
#define OTG_HS_TSDPS (1 << 22)
/* This bit selects utmi_termselect to drive the data line pulse during SRP (session request protocol).
0: Data line pulsing using utmi_txvalid (default)
1: Data line pulsing using utmi_termsel */

/* Bit 21 - ULPI external V BUS indicator */
#define OTG_HS_ULPIEVBUSI (1 << 21)
/* This bit indicates to the ULPI PHY to use an external V BUS overcurrent indicator.
0: PHY uses an internal V BUS valid comparator
1: PHY uses an external V BUS valid comparator */

/* Bit 20 - ULPI External V BUS Drive */
#define OTG_HS_ULPIEVBUSD (1 << 20)
/* This bit selects between internal or external supply to drive 5 V on V BUS , in the ULPI PHY.
0: PHY drives V BUS using internal charge pump (default)
1: PHY drives V BUS using external supply. */

/* Bit 19 - ULPI Clock SuspendM */
#define OTG_HS_ULPICSM (1 << 19)
/* This bit sets the ClockSuspendM bit in the interface control register on the ULPI PHY. This bit applies only in the serial and carkit modes.
0: PHY powers down the internal clock during suspend
1: PHY does not power down the internal clock */

/* Bit 18 - ULPI Auto-resume */
#define OTG_HS_ULPIAR (1 << 18)
/* This bit sets the AutoResume bit in the interface control register on the ULPI PHY.
0: PHY does not use AutoResume feature
1: PHY uses AutoResume feature */

