bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
/* Bit 17 - ULPI FS/LS select */
#define OTG_HS_ULPIFSLS (1 << 17)
/* The application uses this bit to select the FS/LS serial interface for the ULPI PHY. This bit is valid only when the FS serial transceiver is selected on the ULPI PHY.
0: ULPI interface
1: ULPI FS/LS serial interface
Bit 16
Reserved, must be kept at reset value. */

/* Bit 15 - PHY Low-power clock select */
#define OTG_HS_PHYLPCS (1 << 15)
/* This bit selects either 480 MHz or 48 MHz (low-power) PHY mode. In FS and LS modes, the PHY can usually operate on a 48 MHz clock to save power.
0: 480 MHz internal PLL clock
1: 48 MHz external clock
In 480 MHz mode, the UTMI interface operates at either 60 or 30 MHz, depending on whether the 8- or 16-bit data width is selected. In 48 MHz mode, the UTMI interface operates at 48 MHz in FS and LS modes. */

/* Bit 14 Reserved, must be kept at reset value. */


/* Bits [13..10] - USB turnaround time */
#define OTG_HS_TRDT_MSK (((1 << (13 - 10 + 1)) - 1) << 10)
#define OTG_HS_TRDT_SET(VAL) (((VAL) << 10) & OTG_HS_TRDT_MSK)
#define OTG_HS_TRDT_GET(REG) (((REG) & OTG_HS_TRDT_MSK) >> 10)
/* These bits allows to set the turnaround time in PHY clocks. They must be configured according to Table 208: TRDT values, depending on the application AHB frequency. Higher TRDT values allow stretching the USB response time to IN tokens in order to compensate for longer AHB read access latency to the Data FIFO. */

/* Bit 9 - HNP-capable */
#define OTG_HS_HNPCAP (1 << 9)
/* The application uses this bit to control the OTG_HS controller’s HNP capabilities.
0: HNP capability is not enabled
1: HNP capability is enabled
Note: Accessible in both peripheral and host modes. */

/* Bit 8 - SRP-capable */
#define OTG_HS_SRPCAP (1 << 8)
/* The application uses this bit to control the OTG_HS controller’s SRP capabilities. If the core operates as a nonSRP-capable B-device, it cannot request the connected A-device (host) to activate V BUS and start a session.
0: SRP capability is not enabled
1: SRP capability is enabled
Note: Accessible in both peripheral and host modes. */

/* Bit 7 Reserved, must be kept at reset value. */


/* Bit 6 - USB 2.0 high-speed ULPI PHY or USB 1.1 full-speed serial transceiver select */
#define OTG_HS_PHYSEL (1 << 6)
/* 0: USB 2.0 high-speed ULPI PHY
1: USB 1.1 full-speed serial transceiver */

/* Bits 5:3 Reserved, must be kept at reset value. */

/* Bits [2..0] - FS timeout calibration */
#define OTG_HS_TOCAL_MSK (((1 << (2 - 0 + 1)) - 1) << 0)
#define OTG_HS_TOCAL_SET(VAL) (((VAL) << 0) & OTG_HS_TOCAL_MSK)
#define OTG_HS_TOCAL_GET(REG) (((REG) & OTG_HS_TOCAL_MSK) >> 0)
/* The number of PHY clocks that the application programs in this field is added to the full- speed interpacket timeout duration in the core to account for any additional delays introduced by the PHY. This can be required, because the delay introduced by the PHY in generating the line state condition can vary from one PHY to another.
The USB standard timeout value for full-speed operation is 16 to 18 (inclusive) bit times. The application must program this field based on the speed of enumeration. The number of bit times added per PHY clock is 0.25 bit times. */


/* OTG_HS reset register */
#define STM32F_OTG_HS_GRSTCTL 0x010

/* The application uses this register to reset various hardware features inside the core. */

/* Bit 31 - AHB master idle */
#define OTG_HS_AHBIDL (1 << 31)
/* Indicates that the AHB master state machine is in the Idle condition.
Note: Accessible in both peripheral and host modes. */

/* Bit 30 - DMA request signal */
#define OTG_HS_DMAREQ (1 << 30)
/* This bit indicates that the DMA request is in progress. Used for debug.
Bits 29:11
Reserved, must be kept at reset value. */

/* Bits [10..6] - TxFIFO number */
#define OTG_HS_TXFIFO_MSK (((1 << (10 - 6 + 1 + 1)) - 1) << 6)
#define OTG_HS_TXFIFO_SET(VAL) (((VAL) << 6) & OTG_HS_TXFIFO_MSK)
#define OTG_HS_TXFIFO_GET(REG) (((REG) & OTG_HS_TXFIFO_MSK) >> 6)
#define OTG_HS_TXFIFO_0  (0x00 << 6)
#define OTG_HS_TXFIFO_1  (0x01 << 6)
#define OTG_HS_TXFIFO_2  (0x02 << 6)
#define OTG_HS_TXFIFO_3  (0x03 << 6)
#define OTG_HS_TXFIFO_4  (0x04 << 6)
#define OTG_HS_TXFIFO_5  (0x05 << 6)
#define OTG_HS_TXFIFO_6  (0x06 << 6)
#define OTG_HS_TXFIFO_7  (0x07 << 6)
#define OTG_HS_TXFIFO_8  (0x08 << 6)
#define OTG_HS_TXFIFO_9  (0x09 << 6)
#define OTG_HS_TXFIFO_10 (0x0a << 6)
#define OTG_HS_TXFIFO_11 (0x0b << 6)
#define OTG_HS_TXFIFO_12 (0x0c << 6)
#define OTG_HS_TXFIFO_13 (0x0d << 6)
#define OTG_HS_TXFIFO_14 (0x0e << 6)
#define OTG_HS_TXFIFO_15 (0x0f << 6)
#define OTG_HS_TXFIFO_ALL (0x10 << 6)

/* This is the FIFO number that must be flushed using the TxFIFO Flush bit. This field must not be changed until the core clears the TxFIFO Flush bit.
00000: Nonperiodic TxFIFO flush in host mode | Tx FIFO 0 flush in peripheral mode
00001: Periodic TxFIFO flush in host mode | TXFIFO 1 flush in peripheral mode
00010: TXFIFO 2 flush in peripheral mode
...
′′
00101: TXFIFO 15 flush in peripheral mode
′′
10000: Flush all the transmit FIFOs in peripheral or host mode.
Note: Accessible in both peripheral and host modes. */

/* Bit 5 - TxFIFO flush */
#define OTG_HS_TXFFLSH (1 << 5)
/* This bit selectively flushes a single or all transmit FIFOs, but cannot do so if the core is in the midst of a transaction.
The application must write this bit only after checking that the core is neither writing to the TxFIFO nor reading from the TxFIFO. Verify using these registers:
- Read: the NAK effective interrupt ensures the core is not reading from the FIFO
- Write: the AHBIDL bit in OTG_HS_GRSTCTL ensures that the core is not writing anything to the FIFO
Note: Accessible in both peripheral and host modes. */

/* Bit 4 - RxFIFO flush */
#define OTG_HS_RXFFLSH (1 << 4)
/* The application can flush the entire RxFIFO using this bit, but must first ensure that the core is not in the middle of a transaction.
The application must only write to this bit after checking that the core is neither reading from the RxFIFO nor writing to the RxFIFO.
The application must wait until the bit is cleared before performing any other operation. This bit requires 8 clocks (slowest of PHY or AHB clock) to be cleared.
Note: Accessible in both peripheral and host modes. */

/* Bit 2 - Host frame counter reset */
#define OTG_HS_FCRST (1 << 2)
/* The application writes this bit to reset the frame number counter inside the core. When the frame counter is reset, the subsequent SOF sent out by the core has a frame number of 0.
Note: Only accessible in host mode. */

