bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
/* Bit 1 - HCLK soft reset */
#define OTG_HS_HSRST (1 << 1)
/* The application uses this bit to flush the control logic in the AHB Clock domain. Only AHB Clock Domain pipelines are reset.
FIFOs are not flushed with this bit.
All state machines in the AHB clock domain are reset to the Idle state after terminating the transactions on the AHB, following the protocol.
CSR control bits used by the AHB clock domain state machines are cleared.
To clear this interrupt, status mask bits that control the interrupt status and are generated by the AHB clock domain state machine are cleared.
Because interrupt status bits are not cleared, the application can get the status of any core events that occurred after it set this bit.
This is a self-clearing bit that the core clears after all necessary logic is reset in the core. This can take several clocks, depending on the core’s current state.
Note: Accessible in both peripheral and host modes. */

/* Bit 0 - Core soft reset */
#define OTG_HS_CSRST (1 << 0)
/* Resets the HCLK and PCLK domains as follows:
Clears the interrupts and all the CSR register bits except for the following bits:
– RSTPDMODL bit in OTG_HS_PCGCCTL
– GAYEHCLK bit in OTG_HS_PCGCCTL
– PWRCLMP bit in OTG_HS_PCGCCTL
– STPPCLK bit in OTG_HS_PCGCCTL
– FSLSPCS bit in OTG_HS_HCFG
– DSPD bit in OTG_HS_DCFG
All module state machines (except for the AHB slave unit) are reset to the Idle state, and all the transmit FIFOs and the receive FIFO are flushed.
Any transactions on the AHB Master are terminated as soon as possible, after completing the last data phase of an AHB transfer. Any transactions on the USB are terminated immediately.
The application can write to this bit any time it wants to reset the core. This is a self-clearing bit and the core clears this bit after all the necessary logic is reset in the core, which can take several clocks, depending on the current state of the core. Once this bit has been cleared, the software must wait at least 3 PHY clocks before accessing the PHY domain (synchronization delay). The software must also check that bit 31 in this register is set to 1 (AHB Master is Idle) before starting any operation.
Typically, the software reset is used during software development and also when you dynamically change the PHY selection bits in the above listed USB configuration registers.
When you change the PHY, the corresponding clock for the PHY is selected and used in the PHY domain. Once a new clock is selected, the PHY domain has to be reset for proper operation.
Note: Accessible in both peripheral and host modes. */


/* OTG_HS core interrupt register */
#define STM32F_OTG_HS_GINTSTS 0x014

/* This register interrupts the application for system-level events in the current mode (peripheral mode or host mode).
Some of the bits in this register are valid only in host mode, while others are valid in peripheral mode only. This register also indicates the current mode. To clear the interrupt status bits of the rc_w1 type, the application must write 1 into the bit.
The FIFO status interrupts are read-only; once software reads from or writes to the FIFO while servicing these interrupts, FIFO interrupt conditions are cleared automatically.
The application must clear the OTG_HS_GINTSTS register at initialization before unmasking the interrupt bit to avoid any interrupts generated prior to initialization. */

/* Bit 31 - Resume/remote wakeup detected interrupt */
#define OTG_HS_WKUPINT (1 << 31)
/* In peripheral mode, this interrupt is asserted when a resume is detected on the USB. In host mode, this interrupt is asserted when a remote wakeup is detected on the USB.
Note: Accessible in both peripheral and host modes. */

/* Bit 30 - Session request/new session detected interrupt */
#define OTG_HS_SRQINT (1 << 30)
/* In host mode, this interrupt is asserted when a session request is detected from the device. In peripheral mode, this interrupt is asserted when V BUS is in the valid range for a B-device device. Accessible in both peripheral and host modes. */

/* Bit 29 - Disconnect detected interrupt */
#define OTG_HS_DISCINT (1 << 29)
/* Asserted when a device disconnect is detected.
Note: Only accessible in host mode. */

/* Bit 28 - Connector ID status change */
#define OTG_HS_CIDSCHG (1 << 28)
/* The core sets this bit when there is a change in connector ID status.
Note: Accessible in both peripheral and host modes. */

/* Bit 27 Reserved, must be kept at reset value. */


/* Bit 26 - Periodic TxFIFO empty */
#define OTG_HS_PTXFE (1 << 26)
/* Asserted when the periodic transmit FIFO is either half or completely empty and there is space for at least one entry to be written in the periodic request queue. The half or completely empty status is determined by the periodic TxFIFO empty level bit in the Core AHB configuration register (PTXFELVL bit in OTG_HS_GAHBCFG).
Note: Only accessible in host mode. */

/* Bit 25 - Host channels interrupt */
#define OTG_HS_HCINT (1 << 25)
/* The core sets this bit to indicate that an interrupt is pending on one of the channels of the core (in host mode). The application must read the host all channels interrupt (OTG_HS_HAINT) register to determine the exact number of the channel on which the interrupt occurred, and then read the corresponding host channel-x interrupt (OTG_HS_HCINTx) register to determine the exact cause of the interrupt. The application must clear the appropriate status bit in the OTG_HS_HCINTx register to clear this bit.
Note: Only accessible in host mode. */

/* Bit 24 - Host port interrupt */
#define OTG_HS_HPRTINT (1 << 24)
/* The core sets this bit to indicate a change in port status of one of the OTG_HS controller ports in host mode. The application must read the host port control and status (OTG_HS_HPRT) register to determine the exact event that caused this interrupt. The application must clear the appropriate status bit in the host port control and status register to
clear this bit.
Note: Only accessible in host mode. */

