bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
/* Bit 23 Reserved, must be kept at reset value. */


/* Bit 22 - Data fetch suspended */
#define OTG_HS_DATAFSUSP (1 << 22)
/* This interrupt is valid only in DMA mode. This interrupt indicates that the core has stopped fetching data for IN endpoints due to the unavailability of TxFIFO space or request queue space. This interrupt is used by the application for an endpoint mismatch algorithm. For
example, after detecting an endpoint mismatch, the application:
– Sets a global nonperiodic IN NAK handshake
– Disables IN endpoints
– Flushes the FIFO
– Determines the token sequence from the IN token sequence learning queue
– Re-enables the endpoints
– Clears the global nonperiodic IN NAK handshake.
If the global nonperiodic IN NAK is cleared, the core has not yet fetched data for the IN endpoint, and the IN token is received: the core generates an “IN token received when FIFO empty” interrupt.
The OTG then sends a NAK response to the host. To avoid this scenario, the application can check the FetSusp interrupt in OTG_FS_GINTSTS, which ensures that the FIFO is full before clearing a global NAK handshake. Alternatively, the application can mask the “IN token received when FIFO empty” interrupt when clearing a global IN NAK handshake. */

/* Bit 21 - Incomplete periodic transfer */
#define OTG_HS_IPXFR (1 << 21)
/* In host mode, the core sets this interrupt bit when there are incomplete periodic transactions still pending, which are scheduled for the current frame.
Note: Only accessible in host mode. */

/* Bit 21 - Incomplete isochronous OUT transfer */
#define OTG_HS_INCOMPISOOUT (1 << 21)
/* In peripheral mode, the core sets this interrupt to indicate that there is at least one isochronous OUT endpoint on which the transfer is not completed in the current frame. This interrupt is asserted along with the End of periodic frame interrupt (EOPF) bit in this register.
Note: Only accessible in peripheral mode. */

/* Bit 20 - Incomplete isochronous IN transfer */
#define OTG_HS_IISOIXFR (1 << 20)
/* The core sets this interrupt to indicate that there is at least one isochronous IN endpoint on which the transfer is not completed in the current frame. This interrupt is asserted along with the End of periodic frame interrupt (EOPF) bit in this register.
Note: Only accessible in peripheral mode. */

/* Bit 19 - OUT endpoint interrupt */
#define OTG_HS_OEPINT (1 << 19)
/* The core sets this bit to indicate that an interrupt is pending on one of the OUT endpoints of the core (in peripheral mode). The application must read the device all endpoints interrupt (OTG_HS_DAINT) register to determine the exact number of the OUT endpoint on which the interrupt occurred, and then read the corresponding device OUT Endpoint-x Interrupt (OTG_HS_DOEPINTx) register to determine the exact cause of the interrupt. The application must clear the appropriate status bit in the corresponding OTG_HS_DOEPINTx register to clear this bit.
Note: Only accessible in peripheral mode. */

/* Bit 18 - IN endpoint interrupt */
#define OTG_HS_IEPINT (1 << 18)
/* The core sets this bit to indicate that an interrupt is pending on one of the IN endpoints of the core (in peripheral mode). The application must read the device All Endpoints Interrupt (OTG_HS_DAINT) register to determine the exact number of the IN endpoint on which the interrupt occurred, and then read the corresponding device IN Endpoint-x interrupt (OTG_HS_DIEPINTx) register to determine the exact cause of the interrupt. The application must clear the appropriate status bit in the corresponding OTG_HS_DIEPINTx register to clear this bit.
Note: Only accessible in peripheral mode. */

/* [17..16] Reserved, must be kept at reset value. */


/* Bit 15 - End of periodic frame interrupt */
#define OTG_HS_EOPF (1 << 15)
/* Indicates that the period specified in the periodic frame interval field of the device configuration register (PFIVL bit in OTG_HS_DCFG) has been reached in the current frame.
Note: Only accessible in peripheral mode. */

/* Bit 14 - Isochronous OUT packet dropped interrupt */
#define OTG_HS_ISOODRP (1 << 14)
/* The core sets this bit when it fails to write an isochronous OUT packet into the RxFIFO because the RxFIFO does not have enough space to accommodate a maximum size packet for the isochronous OUT endpoint.
Note: Only accessible in peripheral mode. */

/* Bit 13 - Enumeration done */
#define OTG_HS_ENUMDNE (1 << 13)
/* The core sets this bit to indicate that speed enumeration is complete. The application must read the device Status (OTG_HS_DSTS) register to obtain the enumerated speed.
Note: Only accessible in peripheral mode. */

/* Bit 12 - USB reset */
#define OTG_HS_USBRST (1 << 12)
/* The core sets this bit to indicate that a reset is detected on the USB.
Note: Only accessible in peripheral mode. */

/* Bit 11 - USB suspend */
#define OTG_HS_USBSUSP (1 << 11)
/* The core sets this bit to indicate that a suspend was detected on the USB. The core enters the Suspended state when there is no activity on the data lines for a period of 3 ms.
Note: Only accessible in peripheral mode. */

/* Bit 10 - Early suspend */
#define OTG_HS_ESUSP (1 << 10)
/* The core sets this bit to indicate that an Idle state has been detected on the USB for 3 ms.
Note: Only accessible in peripheral mode. */

/* Bit 7 - Global OUT NAK effective */
#define OTG_HS_GONAKEFF (1 << 7)
/* Indicates that the Set global OUT NAK bit in the Device control register (SGONAK bit in OTG_HS_DCTL), set by the application, has taken effect in the core. This bit can be cleared by writing the Clear global OUT NAK bit in the Device control register (CGONAK bit in OTG_HS_DCTL).
Note: Only accessible in peripheral mode. */

/* Bit 6 - Global IN nonperiodic NAK effective */
#define OTG_HS_GINAKEFF (1 << 6)
/* Indicates that the Set global nonperiodic IN NAK bit in the Device control register (SGINAK bit in OTG_HS_DCTL), set by the application, has taken effect in the core. That is, the core has sampled the Global IN NAK bit set by the application. This bit can be cleared by clearing the Clear global nonperiodic IN NAK bit in the Device control register (CGINAK bit in OTG_HS_DCTL).
This interrupt does not necessarily mean that a NAK handshake is sent out on the USB. The STALL bit takes precedence over the NAK bit.
Note: Only accessible in peripheral mode. */

/* Bit 5 - Nonperiodic TxFIFO empty */
#define OTG_HS_NPTXFE (1 << 5)
/* This interrupt is asserted when the nonperiodic TxFIFO is either half or completely empty, and there is space in at least one entry to be written to the nonperiodic transmit request queue. The half or completely empty status is determined by the nonperiodic TxFIFO empty level bit in the OTG_HS_GAHBCFG register (TXFELVL bit in OTG_HS_GAHBCFG).
Note: Only accessible in host mode. */

/* Bit 4 - RxFIFO nonempty */
#define OTG_HS_RXFLVL (1 << 4)
/* Indicates that there is at least one packet pending to be read from the RxFIFO.
Note: Accessible in both host and peripheral modes. */

/* Bit 3 - Start of frame */
#define OTG_HS_SOF (1 << 3)
/* In host mode, the core sets this bit to indicate that an SOF (FS), or Keep-Alive (LS) is transmitted on the USB. The application must write a 1 to this bit to clear the interrupt. In peripheral mode, in the core sets this bit to indicate that an SOF token has been received on the USB. The application can read the Device Status register to get the current frame number. This interrupt is seen only when the core is operating in FS.
Note: Accessible in both host and peripheral modes. */

/* Bit 2 - OTG interrupt */
#define OTG_HS_OTGINT (1 << 2)
/* The core sets this bit to indicate an OTG protocol event. The application must read the OTG Interrupt Status (OTG_HS_GOTGINT) register to determine the exact event that caused this interrupt. The application must clear the appropriate status bit in the OTG_HS_GOTGINT register to clear this bit.
Note: Accessible in both host and peripheral modes. */

