bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
/* Bit 1 - Mode mismatch interrupt */
#define OTG_HS_MMIS (1 << 1)
/* The core sets this bit when the application is trying to access:
A host mode register, when the core is operating in peripheral mode
A peripheral mode register, when the core is operating in host mode
The register access is completed on the AHB with an OKAY response, but is ignored by the core internally and does not affect the operation of the core.
Note: Accessible in both host and peripheral modes. */

/* Bit 0 - Current mode of operation */
#define OTG_HS_CMOD (1 << 0)
/* Indicates the current mode.
0: Peripheral mode
1: Host mode
Note: Accessible in both host and peripheral modes. */


/* OTG_HS interrupt mask register */
#define STM32F_OTG_HS_GINTMSK 0x018

/* This register works with the Core interrupt register to interrupt the application. When an interrupt bit is masked, the interrupt associated with that bit is not generated. However, the
Core Interrupt (OTG_HS_GINTSTS) register bit corresponding to that interrupt is still set. */

/* Bit 31 - Resume/remote wakeup detected interrupt mask */
#define OTG_HS_WUIM (1 << 31)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Accessible in both host and peripheral modes. */

/* Bit 30 - Session request/new session detected interrupt mask */
#define OTG_HS_SRQIM (1 << 30)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Accessible in both host and peripheral modes. */

/* Bit 29 - Disconnect detected interrupt mask */
#define OTG_HS_DISCINT (1 << 29)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Accessible in both host and peripheral modes. */

/* Bit 28 - Connector ID status change mask */
#define OTG_HS_CIDSCHGM (1 << 28)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Accessible in both host and peripheral modes. */

/* Bit 27 Reserved, must be kept at reset value. */


/* Bit 26 - Periodic TxFIFO empty mask */
#define OTG_HS_PTXFEM (1 << 26)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Only accessible in host mode. */

/* Bit 25 - Host channels interrupt mask */
#define OTG_HS_HCIM (1 << 25)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Only accessible in host mode. */

/* Bit 24 - Host port interrupt mask */
#define OTG_HS_PRTIM (1 << 24)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Only accessible in host mode. */

/* Bit 23 Reserved, must be kept at reset value.  */


/* Bit 22 - Data fetch suspended mask */
#define OTG_HS_FSUSPM (1 << 22)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Only accessible in peripheral mode. */

/* Bit 21 - Incomplete periodic transfer mask */
#define OTG_HS_IPXFRM (1 << 21)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Only accessible in host mode. */

/* Bit 21 - Incomplete isochronous OUT transfer mask */
#define OTG_HS_IISOOXFRM (1 << 21)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Only accessible in peripheral mode. */

/* Bit 20 - Incomplete isochronous IN transfer mask */
#define OTG_HS_IISOIXFRM (1 << 20)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Only accessible in peripheral mode. */

/* Bit 19 - OUT endpoints interrupt mask */
#define OTG_HS_OEPINTM (1 << 19)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Only accessible in peripheral mode. */

/* Bit 18 - IN endpoints interrupt mask */
#define OTG_HS_IEPINTM (1 << 18)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Only accessible in peripheral mode. */

/* Bit 17 - Endpoint mismatch interrupt mask */
#define OTG_HS_EPMISM (1 << 17)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Only accessible in peripheral mode. */

/* Bit 16 Reserved, must be kept at reset value. */


/* Bit 15 - End of periodic frame interrupt mask */
#define OTG_HS_EOPFM (1 << 15)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Only accessible in peripheral mode. */

/* Bit 14 - Isochronous OUT packet dropped interrupt mask */
#define OTG_HS_ISOODRPM (1 << 14)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Only accessible in peripheral mode. */

/* Bit 13 - Enumeration done mask */
#define OTG_HS_ENUMDNEM (1 << 13)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Only accessible in peripheral mode. */

/* Bit 12 - USB reset mask */
#define OTG_HS_USBRSTM (1 << 12)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Only accessible in peripheral mode. */

/* Bit 11 - USB suspend mask */
#define OTG_HS_USBSUSPM (1 << 11)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Only accessible in peripheral mode. */

/* Bit 10 - Early suspend mask */
#define OTG_HS_ESUSPM (1 << 10)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Only accessible in peripheral mode. */

/* [9..8] Reserved, must be kept at reset value. */


/* Bit 7 - Global OUT NAK effective mask */
#define OTG_HS_GONAKEFFM (1 << 7)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Only accessible in peripheral mode. */

/* Bit 6 - Global nonperiodic IN NAK effective mask */
#define OTG_HS_GINAKEFFM (1 << 6)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Only accessible in peripheral mode. */

/* Bit 5 - Nonperiodic TxFIFO empty mask */
#define OTG_HS_NPTXFEM (1 << 5)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Accessible in both peripheral and host modes. */

/* Bit 4 - Receive FIFO nonempty mask */
#define OTG_HS_RXFLVLM (1 << 4)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Accessible in both peripheral and host modes. */

/* Bit 3 - Start of frame mask */
#define OTG_HS_SOFM (1 << 3)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Accessible in both peripheral and host modes. */

/* Bit 2 - OTG interrupt mask */
#define OTG_HS_OTGINTM (1 << 2)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Accessible in both peripheral and host modes. */

/* Bit 1 - Mode mismatch interrupt mask */
#define OTG_HS_MMISM (1 << 1)
/* 0: Masked interrupt
1: Unmasked interrupt
Note: Accessible in both peripheral and host modes. */

/* Bit 0 Reserved, must be kept at reset value. */


/* OTG_HS Receive status debug read/OTG status read and pop registers */
#define STM32F_OTG_HS_GRXSTSR 0x01C
#define STM32F_OTG_HS_GRXSTSP 0x020

/* A read to the Receive status debug read register returns the contents of the top of the Receive FIFO. A read to the Receive status read and pop register additionally pops the top data entry out of the RxFIFO.
The receive status contents must be interpreted differently in host and peripheral modes.
The core ignores the receive status pop/read when the receive FIFO is empty and returns a value of 0x0000 0000. The application must only pop the Receive Status FIFO when the Receive FIFO nonempty bit of the Core interrupt register (RXFLVL bit in
OTG_HS_GINTSTS) is asserted. */

/* [31..21] Reserved, must be kept at reset value. */


/* Bits [20..17] - Packet status */
#define OTG_HS_PKTSTS_MSK (((1 << (20 - 17 + 1)) - 1) << 17)
#define OTG_HS_PKTSTS_SET(VAL) (((VAL) << 17) & OTG_HS_PKTSTS_MSK)
#define OTG_HS_PKTSTS_GET(REG) (((REG) & OTG_HS_PKTSTS_MSK) >> 17)

/* Indicates the status of the received packet
0010: IN data packet received
0011: IN transfer completed (triggers an interrupt)
0101: Data toggle error (triggers an interrupt)
0111: Channel halted (triggers an interrupt)
Others: Reserved */

/* Bits [16..15] - Data PID */
#define OTG_HS_DPID_MSK (((1 << (16 - 15 + 1)) - 1) << 15)
#define OTG_HS_DPID_SET(VAL) (((VAL) << 15) & OTG_HS_DPID_MSK)
#define OTG_HS_DPID_GET(REG) (((REG) & OTG_HS_DPID_MSK) >> 15)
/* Indicates the Data PID of the received packet
00: DATA0
10: DATA1
01: DATA2
11: MDATA */

/* Bits [14..4] - Byte count */
#define OTG_HS_BCNT_MSK (((1 << (14 - 4 + 1)) - 1) << 4)
#define OTG_HS_BCNT_SET(VAL) (((VAL) << 4) & OTG_HS_BCNT_MSK)
#define OTG_HS_BCNT_GET(REG) (((REG) & OTG_HS_BCNT_MSK) >> 4)
/* Indicates the byte count of the received IN data packet. */

/* Bits [3..0] - Channel number */
#define OTG_HS_CHNUM_MSK (((1 << (3 - 0 + 1)) - 1) << 0)
#define OTG_HS_CHNUM_SET(VAL) (((VAL) << 0) & OTG_HS_CHNUM_MSK)
#define OTG_HS_CHNUM_GET(REG) (((REG) & OTG_HS_CHNUM_MSK) >> 0)
/* Indicates the channel number to which the current received packet belongs. */ 
/* [31..25] Reserved, must be kept at reset value. */


/* Bits [24..21] - Frame number */
#define OTG_HS_FRMNUM_MSK (((1 << (24 - 21 + 1)) - 1) << 21)
#define OTG_HS_FRMNUM_SET(VAL) (((VAL) << 21) & OTG_HS_FRMNUM_MSK)
#define OTG_HS_FRMNUM_GET(REG) (((REG) & OTG_HS_FRMNUM_MSK) >> 21)
/* This is the least significant 4 bits of the frame number in which the packet is received on the USB. This field is supported only when isochronous OUT endpoints are supported. */

/* Bits [20..17] - Packet status */
#define OTG_HS_PKTSTS_MSK (((1 << (20 - 17 + 1)) - 1) << 17)
#define OTG_HS_PKTSTS_SET(VAL) (((VAL) << 17) & OTG_HS_PKTSTS_MSK)
#define OTG_HS_PKTSTS_GET(REG) (((REG) & OTG_HS_PKTSTS_MSK) >> 17)

#define OTG_HS_PKTSTS_GOUT_NACK      (0x1 << 17)
#define OTG_HS_PKTSTS_OUT_DATA_UPDT  (0x2 << 17)
#define OTG_HS_PKTSTS_OUT_XFER_COMP  (0x3 << 17)
#define OTG_HS_PKTSTS_SETUP_COMP     (0x4 << 17)
#define OTG_HS_PKTSTS_SETUP_UPDT     (0x6 << 17)

/* Indicates the status of the received packet
0001: Global OUT NAK (triggers an interrupt)
0010: OUT data packet received
0011: OUT transfer completed (triggers an interrupt)
0100: SETUP transaction completed (triggers an interrupt)
0110: SETUP data packet received
Others: Reserved */

/* Bits [16..15] - Data PID */
#define __OTG_HS_DPID (((1 << (16 - 15 + 1)) - 1) << 15)
/* Indicates the Data PID of the received OUT data packet
00: DATA0
10: DATA1
01: DATA2
11: MDATA */

/* Bits [14..4] - Byte count */
#define OTG_HS_BCNT_MSK (((1 << (14 - 4 + 1)) - 1) << 4)
#define OTG_HS_BCNT_SET(VAL) (((VAL) << 4) & OTG_HS_BCNT_MSK)
#define OTG_HS_BCNT_GET(REG) (((REG) & OTG_HS_BCNT_MSK) >> 4)
/* Indicates the byte count of the received data packet. */ 

/* Bits [3..0] - Endpoint number */
#define OTG_HS_EPNUM_MSK (((1 << (3 - 0 + 1)) - 1) << 0)
#define OTG_HS_EPNUM_SET(VAL) (((VAL) << 0) & OTG_HS_EPNUM_MSK)
#define OTG_HS_EPNUM_GET(REG) (((REG) & OTG_HS_EPNUM_MSK) >> 0)
/* Indicates the endpoint number to which the current received packet belongs. */


/* OTG_HS Receive FIFO size register */
#define STM32F_OTG_HS_GRXFSIZ 0x024
/* The application can program the RAM size that must be allocated to the RxFIFO. */

/* [31..16] Reserved, must be kept at reset value. */


/* Bits [15..0] - RxFIFO depth */
#define OTG_HS_RXFD_MSK (((1 << (15 - 0 + 1)) - 1) << 0)
#define OTG_HS_RXFD_SET(VAL) (((VAL) << 0) & OTG_HS_RXFD_MSK)
#define OTG_HS_RXFD_GET(REG) (((REG) & OTG_HS_RXFD_MSK) >> 0)
/* This value is in terms of 32-bit words.
Minimum value is 16
Maximum value is 1024
The power-on reset value of this register is specified as the largest Rx data FIFO depth.
OTG_HS nonperiodic transmit FIFO size/Endpoint 0 transmit FIFO size register (OTG_HS_GNPTXFSIZ/OTG_HS_TX0FSIZ)
Address offset: 0x028 */


/* Bits [31..16] - Nonperiodic TxFIFO depth */
#define OTG_HS_NPTXFD_MSK (((1 << (31 - 16 + 1)) - 1) << 16)
#define OTG_HS_NPTXFD_SET(VAL) (((VAL) << 16) & OTG_HS_NPTXFD_MSK)
#define OTG_HS_NPTXFD_GET(REG) (((REG) & OTG_HS_NPTXFD_MSK) >> 16)
/* This value is in terms of 32-bit words.
Minimum value is 16
Maximum value is 1024 */

