bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
/* Bits [15..0] - Nonperiodic transmit RAM start address */
#define OTG_HS_NPTXFSA_MSK (((1 << (15 - 0 + 1)) - 1) << 0)
#define OTG_HS_NPTXFSA_SET(VAL) (((VAL) << 0) & OTG_HS_NPTXFSA_MSK)
#define OTG_HS_NPTXFSA_GET(REG) (((REG) & OTG_HS_NPTXFSA_MSK) >> 0)
/* This field contains the memory start address for nonperiodic transmit FIFO RAM. */

/* Bits [31..16] - Endpoint 0 TxFIFO depth */
#define OTG_HS_TX0FD_MSK (((1 << (31 - 16 + 1)) - 1) << 16)
#define OTG_HS_TX0FD_SET(VAL) (((VAL) << 16) & OTG_HS_TX0FD_MSK)
#define OTG_HS_TX0FD_GET(REG) (((REG) & OTG_HS_TX0FD_MSK) >> 16)
/* This value is in terms of 32-bit words.
Minimum value is 16
Maximum value is 256 */

/* Bits [15..0] - Endpoint 0 transmit RAM start address */
#define OTG_HS_TX0FSA_MSK (((1 << (15 - 0 + 1)) - 1) << 0)
#define OTG_HS_TX0FSA_SET(VAL) (((VAL) << 0) & OTG_HS_TX0FSA_MSK)
#define OTG_HS_TX0FSA_GET(REG) (((REG) & OTG_HS_TX0FSA_MSK) >> 0)
/* This field contains the memory start address for Endpoint 0 transmit FIFO RAM. */


/* OTG_HS nonperiodic transmit FIFO/queue status register */
#define STM32F_OTG_HS_GNPTXSTS 0x02C

/* Note:
In peripheral mode, this register is not valid.
This read-only register contains the free space information for the nonperiodic TxFIFO and the nonperiodic transmit request queue. */

/* Bit 31 Reserved, must be kept at reset value. */


/* Bits [30..24] - Top of the nonperiodic transmit request queue Entry in the nonperiodic Tx request queue that is currently being processed by the MAC. */
#define OTG_HS_NPTXQTOP_MSK (((1 << (30 - 24 + 1)) - 1) << 24)
#define OTG_HS_NPTXQTOP_SET(VAL) (((VAL) << 24) & OTG_HS_NPTXQTOP_MSK)
#define OTG_HS_NPTXQTOP_GET(REG) (((REG) & OTG_HS_NPTXQTOP_MSK) >> 24)
/* Bits [30:27]: Channel/endpoint number
Bits [26:25]:
– 00: IN/OUT token
– 01: Zero-length transmit packet (device IN/host OUT)
– 10: PING/CSPLIT token
– 11: Channel halt command
Bit [24]: Terminate (last entry for selected channel/endpoint) */

/* Bits [23..16] - Nonperiodic transmit request queue space available */
#define OTG_HS_NPTQXSAV_MSK (((1 << (23 - 16 + 1)) - 1) << 16)
#define OTG_HS_NPTQXSAV_SET(VAL) (((VAL) << 16) & OTG_HS_NPTQXSAV_MSK)
#define OTG_HS_NPTQXSAV_GET(REG) (((REG) & OTG_HS_NPTQXSAV_MSK) >> 16)
/* Indicates the amount of free space available in the nonperiodic transmit request queue.
This queue holds both IN and OUT requests in host mode. Peripheral mode has only IN requests.
00: Nonperiodic transmit request queue is full
01: dx1 location available
10: dx2 locations available
bxn: dxn locations available (0 ≤ n ≤ dx8)
Others: Reserved */

/* Bits [15..0] - Nonperiodic TxFIFO space available */
#define OTG_HS_NPTXFSAV_MSK (((1 << (15 - 0 + 1)) - 1) << 0)
#define OTG_HS_NPTXFSAV_SET(VAL) (((VAL) << 0) & OTG_HS_NPTXFSAV_MSK)
#define OTG_HS_NPTXFSAV_GET(REG) (((REG) & OTG_HS_NPTXFSAV_MSK) >> 0)
/* Indicates the amount of free space available in the nonperiodic TxFIFO.
Values are in terms of 32-bit words.
00: Nonperiodic TxFIFO is full
01: dx1 word available
10: dx2 words available
0xn: dxn words available (where 0 ≤ n ≤ dx1024)
Others: Reserved */


/* OTG_HSI2C access register */
#define STM32F_OTG_HS_GI2CCTL 0x030



/* Bit 31 - I2C Busy/Done */
#define OTG_HS_BSYDNE (1 << 31)
/* The application sets this bit to 1 to start a request on the I2C interface. When the transfer is complete, the core deasserts this bit to 0. As long as the bit is set indicating that the I2C interface is busy, the application cannot start another request on the interface. */

/* Bit 30 - Read/Write Indicator */
#define OTG_HS_RW (1 << 30)
/* This bit indicates whether a read or write register transfer must be performed on the interface.
0: Write
1: Read
Note: Read/write bursting is not supported for registers. */

/* Bit 29 Reserved, must be kept at reset value. */


/* Bit 28 - I2C DatSe0 USB mode */
#define OTG_HS_I2CDATSE0 (1 << 28)
/* This bit is used to select the full-speed interface USB mode.
0: VP_VM USB mode
1: DAT_SE0 USB mode */

/* Bits [27..26] - I2C Device Address */
#define OTG_HS_I2CDEVADR (((1 << (27 - 26 + 1)) - 1) << 26)
/* This bit selects the address of the I2C slave on the USB 1.1 full-speed serial transceiver corresponding to the one used by the core for OTG signalling. */

/* Bit 25 Reserved, must be kept at reset value. */


/* Bit 24 - I2C ACK */
#define OTG_HS_I2CACK (1 << 24)
/* This bit indicates whether an ACK response was received from the I2C slave. It is valid when BSYDNE is cleared by the core, after the application has initiated an I2C access.
0: NAK
1: ACK */

/* Bit 23 - I2C Enable */
#define OTG_HS_I2CEN (1 << 23)
/* This bit enables the I2C master to initiate transactions on the I2C interface. */

/* Bits [22..16] - I2C Address */
#define OTG_HS_ADDR_MSK (((1 << (22 - 16 + 1)) - 1) << 16)
#define OTG_HS_ADDR_SET(VAL) (((VAL) << 16) & OTG_HS_ADDR_MSK)
#define OTG_HS_ADDR_GET(REG) (((REG) & OTG_HS_ADDR_MSK) >> 16)
/* This is the 7-bit I2C device address used by the application to access any external I2C slave, including the I2C slave on a USB 1.1 OTG full-speed serial transceiver. */

/* Bits [15..8] - I2C Register Address */
#define OTG_HS_REGADDR_MSK (((1 << (15 - 8 + 1)) - 1) << 8)
#define OTG_HS_REGADDR_SET(VAL) (((VAL) << 8) & OTG_HS_REGADDR_MSK)
#define OTG_HS_REGADDR_GET(REG) (((REG) & OTG_HS_REGADDR_MSK) >> 8)
/* These bits allow to program the address of the register to be read from or written to. */

/* Bits [7..0] - I2C Read/Write Data */
#define OTG_HS_RWDATA_MSK (((1 << (7 - 0 + 1)) - 1) << 0)
#define OTG_HS_RWDATA_SET(VAL) (((VAL) << 0) & OTG_HS_RWDATA_MSK)
#define OTG_HS_RWDATA_GET(REG) (((REG) & OTG_HS_RWDATA_MSK) >> 0)
/* After a register read operation, these bits hold the read data for the application.
During a write operation, the application can use this register to program the data to be written to a register. */


/* OTG_HS general core configuration register */
#define STM32F_OTG_HS_GCCFG 0x038



/* [31..22] Reserved, must be kept at reset value. */


/* Bit 21 - V BUS sensing disable option */
#define OTG_HS_NOVBUSSENS (1 << 21)
/* When this bit is set, V BUS is considered internally to be always at V BUS valid level (5 V). This option removes the need for a dedicated V BUS pad, and leave this pad free to be used for other purposes such as a shared functionality. V BUS connection can be remapped on another general purpose input pad and monitored by software.
This option is only suitable for host-only or device-only applications.
0: V BUS sensing available by hardware
1: V BUS sensing not available by hardware. */

/* Bit 20 - SOF output enable */
#define OTG_HS_SOFOUTEN (1 << 20)
/* 0: SOF pulse not available on PAD
1: SOF pulse available on PAD */

/* Bit 19 - Enable the V BUS sensing “B” device */
#define OTG_HS_VBUSBSEN (1 << 19)
/* 0: V BUS sensing “B” disabled
1: V BUS sensing “B” enabled */

/* Bit 18 - Enable the V BUS sensing “A” device */
#define OTG_HS_VBUSASEN (1 << 18)
/* 0: V BUS sensing “A” disabled
1: V BUS sensing “A” enabled */

/* Bit 17 - Enable I2C bus connection for the external I2C PHY interface. */
#define OTG_HS_I2CPADEN (1 << 17)
/* 0: I2C bus disabled
1: I2C bus enabled */

/* Bit 16 - Power down */
#define OTG_HS_PWRDWN (1 << 16)
/* Used to activate the transceiver in transmission/reception
0: Power down active
1: Power down deactivated (“Transceiver active”) */

/* [15..0] Reserved, must be kept at reset value. */



