bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
/* OTG_HS core ID register */
#define STM32F_OTG_HS_CID 0x03C

/* This is a read only register containing the Product ID. */

/* Bits [31..0] - Product ID field */
#define OTG_HS_PRODUCT_ID_MSK (((1 << (31 - 0 + 1)) - 1) << 0)
#define OTG_HS_PRODUCT_ID_SET(VAL) (((VAL) << 0) & OTG_HS_PRODUCT_ID_MSK)
#define OTG_HS_PRODUCT_ID_GET(REG) (((REG) & OTG_HS_PRODUCT_ID_MSK) >> 0)
/* Application-programmable ID field. */


/* OTG_HS Host periodic transmit FIFO size register */
#define STM32F_OTG_HS_HPTXFSIZ 0x100



/* Bits [31..16] - Host periodic TxFIFO depth */
#define OTG_HS_PTXFD_MSK (((1 << (31 - 16 + 1)) - 1) << 16)
#define OTG_HS_PTXFD_SET(VAL) (((VAL) << 16) & OTG_HS_PTXFD_MSK)
#define OTG_HS_PTXFD_GET(REG) (((REG) & OTG_HS_PTXFD_MSK) >> 16)
/* This value is in terms of 32-bit words.
Minimum value is 16
Maximum value is 512 */

/* Bits [15..0] - Host periodic TxFIFO start address */
#define OTG_HS_PTXSA_MSK (((1 << (15 - 0 + 1)) - 1) << 0)
#define OTG_HS_PTXSA_SET(VAL) (((VAL) << 0) & OTG_HS_PTXSA_MSK)
#define OTG_HS_PTXSA_GET(REG) (((REG) & OTG_HS_PTXSA_MSK) >> 0)
/* The power-on reset value of this register is the sum of the largest Rx data FIFO depth and
largest nonperiodic Tx data FIFO depth. */


/* OTG_HS device IN endpoint transmit FIFO size register */
#define STM32F_OTG_HS_DIEPTXFX 0x104



/* Bits [31..16] - IN endpoint TxFIFO depth */
#define OTG_HS_INEPTXFD_MSK (((1 << (31 - 16 + 1)) - 1) << 16)
#define OTG_HS_INEPTXFD_SET(VAL) (((VAL) << 16) & OTG_HS_INEPTXFD_MSK)
#define OTG_HS_INEPTXFD_GET(REG) (((REG) & OTG_HS_INEPTXFD_MSK) >> 16)
/* This value is in terms of 32-bit words.
Minimum value is 16
Maximum value is 512
The power-on reset value of this register is specified as the largest IN endpoint FIFO
number depth. */

/* Bits [15..0] - IN endpoint FIFOx transmit RAM start address */
#define OTG_HS_INEPTXSA_MSK (((1 << (15 - 0 + 1)) - 1) << 0)
#define OTG_HS_INEPTXSA_SET(VAL) (((VAL) << 0) & OTG_HS_INEPTXSA_MSK)
#define OTG_HS_INEPTXSA_GET(REG) (((REG) & OTG_HS_INEPTXSA_MSK) >> 0)
/* This field contains the memory start address for IN endpoint transmit FIFOx. The address
must be aligned with a 32-bit memory location.

Host-mode registers
Bit values in the register descriptions are expressed in binary unless otherwise specified.
Host-mode registers affect the operation of the core in the host mode. Host mode registers must not be accessed in peripheral mode, as the results are undefined. Host mode registers can be categorized as follows: */


/* OTG_HS host configuration register */
#define STM32F_OTG_HS_HCFG 0x400

/* This register configures the core after power-on. Do not change to this register after initializing the host. */

/* [31..3] Reserved, must be kept at reset value. */


/* Bit 2 - FS- and LS-only support */
#define OTG_HS_FSLSS (1 << 2)
/* The application uses this bit to control the core’s enumeration speed. Using this bit, the application can make the core enumerate as an FS host, even if the connected device supports HS traffic. Do not make changes to this field after initial programming. 
0: HS/FS/LS, based on the maximum speed supported by the connected device
1: FS/LS-only, even if the connected device can support HS (read-only) */

/* Bits [1..0] - FS/LS PHY clock select */
#define OTG_HS_FSLSPCS_MSK (((1 << (1 - 0 + 1)) - 1) << 0)
#define OTG_HS_FSLSPCS_SET(VAL) (((VAL) << 0) & OTG_HS_FSLSPCS_MSK)
#define OTG_HS_FSLSPCS_GET(REG) (((REG) & OTG_HS_FSLSPCS_MSK) >> 0)
/* When the core is in FS host mode:
01: PHY clock is running at 48 MHz
Others: Reserved
When the core is in LS host mode:
00: Reserved
01: PHY clock is running at 48 MHz.
10: Select 6 MHz PHY clock frequency
11: Reserved
Note: The FSLSPCS bit must be set on a connection event according to the speed of the connected device. A software reset must be performed after changing this bit. */


/* OTG_HS Host frame interval register */
#define STM32F_OTG_HS_HFIR 0x404

/* This register stores the frame interval information for the current speed to which the OTG_HS controller has enumerated. */

/* [31..16] Reserved, must be kept at reset value. */


/* Bits [15..0] - Frame interval */
#define OTG_HS_FRIVL_MSK (((1 << (15 - 0 + 1)) - 1) << 0)
#define OTG_HS_FRIVL_SET(VAL) (((VAL) << 0) & OTG_HS_FRIVL_MSK)
#define OTG_HS_FRIVL_GET(REG) (((REG) & OTG_HS_FRIVL_MSK) >> 0)
/* The value that the application programs to this field specifies the interval between two consecutive SOFs (FS), micro-SOFs (HS) or Keep-Alive tokens (LS). This field contains the number of PHY clocks that constitute the required frame interval. The application can write a value to this register only after the Port enable bit of the host port control and status register (PENA bit in OTG_HS_HPRT) has been set. If no value is programmed, the core calculates the value based on the PHY clock specified in the FS/LS PHY Clock Select field of the Host configuration register (FSLSPCS in OTG_HS_HCFG): frame duration × PHY clock frequency
Note: The FRIVL bit can be modified whenever the application needs to change the Frame interval time. */


/* OTG_HS host frame number/frame time remaining register */
#define STM32F_OTG_HS_HFNUM 0x408

/* This register indicates the current frame number. It also indicates the time remaining (in terms of the number of PHY clocks) in the current frame. */

/* Bits [31..16] - Frame time remaining */
#define OTG_HS_FTREM_MSK (((1 << (31 - 16 + 1)) - 1) << 16)
#define OTG_HS_FTREM_SET(VAL) (((VAL) << 16) & OTG_HS_FTREM_MSK)
#define OTG_HS_FTREM_GET(REG) (((REG) & OTG_HS_FTREM_MSK) >> 16)
/* Indicates the amount of time remaining in the current frame, in terms of PHY clocks. This field decrements on each PHY clock. When it reaches zero, this field is reloaded with the value in the Frame interval register and a new SOF is transmitted on the USB. */

/* Bits [15..0] - Frame number */
#define OTG_HS_FRNUM_MSK (((1 << (15 - 0 + 1)) - 1) << 0)
#define OTG_HS_FRNUM_SET(VAL) (((VAL) << 0) & OTG_HS_FRNUM_MSK)
#define OTG_HS_FRNUM_GET(REG) (((REG) & OTG_HS_FRNUM_MSK) >> 0)
/* This field increments when a new SOF is transmitted on the USB, and is cleared to 0 when it reaches 0x3FFF. */


/* OTG_HS_Host periodic transmit FIFO/queue status register */
#define STM32F_OTG_HS_HPTXSTS 0x410

/* This read-only register contains the free space information for the periodic TxFIFO and the periodic transmit request queue. */

/* Bits [31..24] - Top of the periodic transmit request queue */
#define OTG_HS_PTXQTOP_MSK (((1 << (31 - 24 + 1)) - 1) << 24)
#define OTG_HS_PTXQTOP_SET(VAL) (((VAL) << 24) & OTG_HS_PTXQTOP_MSK)
#define OTG_HS_PTXQTOP_GET(REG) (((REG) & OTG_HS_PTXQTOP_MSK) >> 24)
/* This indicates the entry in the periodic Tx request queue that is currently being processed by the MAC.
This register is used for debugging.
Bit [31]: Odd/Even frame
– 0: send in even (micro) frame
– 1: send in odd (micro) frame
Bits [30:27]: Channel/endpoint number
Bits [26:25]: Type
– 00: IN/OUT
– 01: Zero-length packet
– 11: Disable channel command
Bit [24]: Terminate (last entry for the selected channel/endpoint) */

/* Bits [23..16] - Periodic transmit request queue space available */
#define OTG_HS_PTXQSAV_MSK (((1 << (23 - 16 + 1)) - 1) << 16)
#define OTG_HS_PTXQSAV_SET(VAL) (((VAL) << 16) & OTG_HS_PTXQSAV_MSK)
#define OTG_HS_PTXQSAV_GET(REG) (((REG) & OTG_HS_PTXQSAV_MSK) >> 16)
/* Indicates the number of free locations available to be written in the periodic transmit request
queue. This queue holds both IN and OUT requests.
00: Periodic transmit request queue is full
01: dx1 location available
10: dx2 locations available
bxn: dxn locations available (0 ≤ dxn ≤ PTXFD)
Others: Reserved */

/* Bits [15..0] - Periodic transmit data FIFO space available */
#define OTG_HS_PTXFSAVL_MSK (((1 << (15 - 0 + 1)) - 1) << 0)
#define OTG_HS_PTXFSAVL_SET(VAL) (((VAL) << 0) & OTG_HS_PTXFSAVL_MSK)
#define OTG_HS_PTXFSAVL_GET(REG) (((REG) & OTG_HS_PTXFSAVL_MSK) >> 0)
/* Indicates the number of free locations available to be written to in the periodic TxFIFO.
Values are in terms of 32-bit words
0000: Periodic TxFIFO is full
0001: dx1 word available
0010: dx2 words available
bxn: dxn words available (where 0 ≤ dxn ≤ dx512)
Others: Reserved */


/* OTG_HS Host all channels interrupt register */
#define STM32F_OTG_HS_HAINT 0x414

/* When a significant event occurs on a channel, the host all channels interrupt register interrupts the application using the host channels interrupt bit of the Core interrupt register (HCINT bit in OTG_HS_GINTSTS). This is shown in Figure 412. There is one interrupt bit per channel, up to a maximum of 16 bits. Bits in this register are set and cleared when the application sets and clears bits in the corresponding host channel-x interrupt register. */

/* [31..16] Reserved, must be kept at reset value. */


/* Bits [15..0] - Channel interrupts */
#define OTG_HS_HAINT_MSK (((1 << (15 - 0 + 1)) - 1) << 0)
#define OTG_HS_HAINT_SET(VAL) (((VAL) << 0) & OTG_HS_HAINT_MSK)
#define OTG_HS_HAINT_GET(REG) (((REG) & OTG_HS_HAINT_MSK) >> 0)
/* One bit per channel: Bit 0 for Channel 0, bit 15 for Channel 15 */


