bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
/* OTG_HS host all channels interrupt mask register */
#define STM32F_OTG_HS_HAINTMSK 0x418

/* The host all channel interrupt mask register works with the host all channel interrupt register to interrupt the application when an event occurs on a channel. There is one interrupt mask bit per channel, up to a maximum of 16 bits. */

/* [31..16] Reserved, must be kept at reset value. */


/* Bits [15..0] - Channel interrupt mask */
#define OTG_HS_HAINTM_MSK (((1 << (15 - 0 + 1)) - 1) << 0)
#define OTG_HS_HAINTM_SET(VAL) (((VAL) << 0) & OTG_HS_HAINTM_MSK)
#define OTG_HS_HAINTM_GET(REG) (((REG) & OTG_HS_HAINTM_MSK) >> 0)
/* 0: Masked interrupt
1: Unmasked interrupt
One bit per channel: Bit 0 for channel 0, bit 15 for channel 15 */


/* OTG_HS host port control and status register */
#define STM32F_OTG_HS_HPRT 0x440

/* This register is available only in host mode. Currently, the OTG host supports only one port.
A single register holds USB port-related information such as USB reset, enable, suspend, resume, connect status, and test mode for each port. It is shown in Figure 412. The rc_w1 bits in this register can trigger an interrupt to the application through the host port interrupt bit of the core interrupt register (HPRTINT bit in OTG_HS_GINTSTS). On a Port Interrupt, the application must read this register and clear the bit that caused the interrupt. For the rc_w1 bits, the application must write a 1 to the bit to clear the interrupt. */

/* [31..19] Reserved, must be kept at reset value. */


/* Bits [18..17] - Port speed */
#define OTG_HS_PSPD_MSK (((1 << (18 - 17 + 1)) - 1) << 17)
#define OTG_HS_PSPD_SET(VAL) (((VAL) << 17) & OTG_HS_PSPD_MSK)
#define OTG_HS_PSPD_GET(REG) (((REG) & OTG_HS_PSPD_MSK) >> 17)
/* Indicates the speed of the device attached to this port.
00: High speed
01: Full speed
10: Low speed
11: Reserved */

/* Bits [16..13] - Port test control */
#define OTG_HS_PTCTL_MSK (((1 << (16 - 13 + 1)) - 1) << 13)
#define OTG_HS_PTCTL_SET(VAL) (((VAL) << 13) & OTG_HS_PTCTL_MSK)
#define OTG_HS_PTCTL_GET(REG) (((REG) & OTG_HS_PTCTL_MSK) >> 13)
/* The application writes a nonzero value to this field to put the port into a Test mode, and the corresponding pattern is signaled on the port.
0000: Test mode disabled
0001: Test_J mode
0010: Test_K mode
0011: Test_SE0_NAK mode
0100: Test_Packet mode
0101: Test_Force_Enable
Others: Reserved */

/* Bit 12 - Port power */
#define OTG_HS_PPWR (1 << 12)
/* The application uses this field to control power to this port, and the core clears this bit on an overcurrent condition.
0: Power off
1: Power on */

/* Bits [11..10] - Port line status */
#define OTG_HS_PLSTS_MSK (((1 << (11 - 10 + 1)) - 1) << 10)
#define OTG_HS_PLSTS_SET(VAL) (((VAL) << 10) & OTG_HS_PLSTS_MSK)
#define OTG_HS_PLSTS_GET(REG) (((REG) & OTG_HS_PLSTS_MSK) >> 10)
/* Indicates the current logic level USB data lines
Bit [10]: Logic level of OTG_HS_FS_DP
Bit [11]: Logic level of OTG_HS_FS_DM */

/* Bit 9 Reserved, must be kept at reset value. */


/* Bit 8 - Port reset */
#define OTG_HS_PRST (1 << 8)
/* When the application sets this bit, a reset sequence is started on this port. The application must time the reset period and clear this bit after the reset sequence is complete.
0: Port not in reset
1: Port in reset
The application must leave this bit set for a minimum duration of at least 10 ms to start a reset on the port. The application can leave it set for another 10 ms in addition to the required minimum duration, before clearing the bit, even though there is no maximum limit set by the USB standard.
High speed: 50 ms
Full speed/Low speed: 10 ms */

/* Bit 7 - Port suspend */
#define OTG_HS_PSUSP (1 << 7)
/* The application sets this bit to put this port in Suspend mode. The core only stops sending SOFs when this is set. To stop the PHY clock, the application must set the Port clock stop bit, which asserts the suspend input pin of the PHY.
The read value of this bit reflects the current suspend status of the port. This bit is cleared by the core after a remote wakeup signal is detected or the application sets the Port reset bit or Port resume bit in this register or the Resume/remote wakeup detected interrupt bit or Disconnect detected interrupt bit in the Core interrupt register (WKUINT or DISCINT in OTG_HS_GINTSTS, respectively).
0: Port not in Suspend mode
1: Port in Suspend mode
Bit 6
PRES: Port resume
The application sets this bit to drive resume signaling on the port. The core continues to drive the resume signal until the application clears this bit. If the core detects a USB remote wakeup sequence, as indicated by the Port resume/remote wakeup detected interrupt bit of the Core interrupt register (WKUINT bit in OTG_HS_GINTSTS), the core starts driving resume signaling without application intervention and clears this bit when it detects a disconnect condition. The read value of this bit indicates whether the core is currently driving resume signaling.
0: No resume driven
1: Resume driven */

/* Bit 5 - Port overcurrent change */
#define OTG_HS_POCCHNG (1 << 5)
/* The core sets this bit when the status of the Port overcurrent active bit (bit 4) in this register changes. */

/* Bit 4 - Port overcurrent active */
#define OTG_HS_POCA (1 << 4)
/* Indicates the overcurrent condition of the port.
0: No overcurrent condition
1: Overcurrent condition */

/* Bit 3 - Port enable/disable change */
#define OTG_HS_PENCHNG (1 << 3)
/* The core sets this bit when the status of the Port enable bit [2] in this register changes. */

/* Bit 2 - Port enable */
#define OTG_HS_PENA (1 << 2)
/* A port is enabled only by the core after a reset sequence, and is disabled by an overcurrent condition, a disconnect condition, or by the application clearing this bit. The application cannot set this bit by a register write. It can only clear it to disable the port. This bit does not trigger any interrupt to the application.
0: Port disabled
1: Port enabled */

/* Bit 1 - Port connect detected */
#define OTG_HS_PCDET (1 << 1)
/* The core sets this bit when a device connection is detected to trigger an interrupt to the application using the host port interrupt bit in the Core interrupt register (HPRTINT bit in OTG_HS_GINTSTS). The application must write a 1 to this bit to clear the interrupt. */

/* Bit 0 - Port connect status */
#define OTG_HS_PCSTS (1 << 0)
/* 0: No device is attached to the port
1: A device is attached to the port */


/* OTG_HS host channel-x characteristics register */
#define STM32F_OTG_HS_HCCHARX 0x500



/* Bit 31 - Channel enable */
#define OTG_HS_CHENA (1 << 31)
/* This field is set by the application and cleared by the OTG host.
0: Channel disabled
1: Channel enabled */

/* Bit 30 - Channel disable */
#define OTG_HS_CHDIS (1 << 30)
/* The application sets this bit to stop transmitting/receiving data on a channel, even before the transfer for that channel is complete. The application must wait for the Channel disabled interrupt before treating the channel as disabled. */

