bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
/* Bit 29 - Odd frame */
#define OTG_HS_ODDFRM (1 << 29)
/* This field is set (reset) by the application to indicate that the OTG host must perform a transfer in an odd frame. This field is applicable for only periodic (isochronous and interrupt) transactions.
0: Even (micro) frame
1: Odd (micro) frame */

/* Bits [28..22] - Device address */
#define __OTG_HS_DAD (((1 << (28 - 22 + 1)) - 1) << 22)
/* This field selects the specific device serving as the data source or sink. */

/* Bits [21..20] - Multi Count (MC) / Error Count (EC) */
#define OTG_HS_MC_MSK (((1 << (21 - 20 + 1)) - 1) << 20)
#define OTG_HS_MC_SET(VAL) (((VAL) << 20) & OTG_HS_MC_MSK)
#define OTG_HS_MC_GET(REG) (((REG) & OTG_HS_MC_MSK) >> 20)
/* – When the split enable bit (SPLITEN) in the host channel-x split control register (OTG_HS_HCSPLTx) is reset (0), this field indicates to the host the number of transactions that must be executed per micro-frame for this periodic endpoint. For nonperiodic transfers, this field specifies the number of packets to be fetched for this channel before the internal DMA engine changes arbitration.
00: Reserved This field yields undefined results
01: 1 transaction
10: 2 transactions to be issued for this endpoint per micro-frame
11: 3 transactions to be issued for this endpoint per micro-frame.
– When the SPLITEN bit is set (1) in OTG_HS_HCSPLTx, this field indicates the number of immediate retries to be performed for a periodic split transaction on transaction errors. This field must be set to at least 01. */

/* Bits [19..18] - Endpoint type */
#define OTG_HS_EPTYP_MSK (((1 << (19 - 18 + 1)) - 1) << 18)
#define OTG_HS_EPTYP_SET(VAL) (((VAL) << 18) & OTG_HS_EPTYP_MSK)
#define OTG_HS_EPTYP_GET(REG) (((REG) & OTG_HS_EPTYP_MSK) >> 18)
#define OTG_HS_EPTYP_CTRL (0)
#define OTG_HS_EPTYP_ISOC (1)
#define OTG_HS_EPTYP_BULK (2)
#define OTG_HS_EPTYP_INT  (3)
/* Indicates the transfer type selected.
00: Control
01: Isochronous
10: Bulk
11: Interrupt */

/* Bit 17 - Low-speed device */
#define OTG_HS_LSDEV (1 << 17)
/* This field is set by the application to indicate that this channel is communicating to a low- speed device. */

/* Bit 16 Reserved, must be kept at reset value. */


/* Bit 15 - Endpoint direction */
#define OTG_HS_EPDIR (1 << 15)
/* Indicates whether the transaction is IN or OUT.
0: OUT
1: IN */

/* Bits [14..11] - Endpoint number */
//#define OTG_HS_EPNUM_MSK (((1 << (14 - 11 + 1)) - 1) << 11)
//#define OTG_HS_EPNUM_SET(VAL) (((VAL) << 11) & OTG_HS_EPNUM_MSK)
//#define OTG_HS_EPNUM_GET(REG) (((REG) & OTG_HS_EPNUM_MSK) >> 11)
#define OTG_HS_HCCHARX_EPNUM_MSK (((1 << (14 - 11 + 1)) - 1) << 11)
#define OTG_HS_HCCHARX_EPNUM_SET(VAL) (((VAL) << 11) & OTG_HS_HCCHARX_EPNUM_MSK)
#define OTG_HS_HCCHARX_EPNUM_GET(REG) (((REG) & OTG_HS_HCCHARX_EPNUM_MSK) >> 11)
/* Indicates the endpoint number on the device serving as the data source or sink. */

/* Bits [10..0] - Maximum packet size */
#define OTG_HS_MPSIZ_MSK (((1 << (10 - 0 + 1)) - 1) << 0)
#define OTG_HS_MPSIZ_SET(VAL) (((VAL) << 0) & OTG_HS_MPSIZ_MSK)
#define OTG_HS_MPSIZ_GET(REG) (((REG) & OTG_HS_MPSIZ_MSK) >> 0)
/* Indicates the maximum packet size of the associated endpoint. */


/* OTG_HS host channel-x split control register */
#define STM32F_OTG_HS_HCSPLTX 0x504



/* Bit 31 - Split enable */
#define OTG_HS_SPLITEN (1 << 31)
/* The application sets this bit to indicate that this channel is enabled to perform split transactions.
Bits 30:17
Reserved, must be kept at reset value. */

/* Bit 16 - Do complete split */
#define OTG_HS_COMPLSPLT (1 << 16)
/* The application sets this bit to request the OTG host to perform a complete split transaction. */

/* Bits [15..14] - Transaction position */
#define OTG_HS_XACTPOS_MSK (((1 << (15 - 14 + 1)) - 1) << 14)
#define OTG_HS_XACTPOS_SET(VAL) (((VAL) << 14) & OTG_HS_XACTPOS_MSK)
#define OTG_HS_XACTPOS_GET(REG) (((REG) & OTG_HS_XACTPOS_MSK) >> 14)
/* This field is used to determine whether to send all, first, middle, or last payloads with each OUT transaction.
11: All. This is the entire data payload of this transaction (which is less than or equal to 188 bytes)
10: Begin. This is the first data payload of this transaction (which is larger than 188 bytes)
00: Mid. This is the middle payload of this transaction (which is larger than 188 bytes)
01: End. This is the last payload of this transaction (which is larger than 188 bytes) */

/* Bits [13..7] - Hub address */
#define OTG_HS_HUBADDR_MSK (((1 << (13 - 7 + 1)) - 1) << 7)
#define OTG_HS_HUBADDR_SET(VAL) (((VAL) << 7) & OTG_HS_HUBADDR_MSK)
#define OTG_HS_HUBADDR_GET(REG) (((REG) & OTG_HS_HUBADDR_MSK) >> 7)
/* This field holds the device address of the transaction translator’s hub. */

/* Bits [6..0] - Port address */
#define OTG_HS_PRTADDR_MSK (((1 << (6 - 0 + 1)) - 1) << 0)
#define OTG_HS_PRTADDR_SET(VAL) (((VAL) << 0) & OTG_HS_PRTADDR_MSK)
#define OTG_HS_PRTADDR_GET(REG) (((REG) & OTG_HS_PRTADDR_MSK) >> 0)
/* This field is the port number of the recipient transaction translator. */


/* OTG_HS host channel-x interrupt register */
#define STM32F_OTG_HS_HCINTX 0x508

/* This register indicates the status of a channel with respect to USB- and AHB-related events. It is shown in Figure 412. The application must read this register when the host channels interrupt bit in the Core interrupt register (HCINT bit in OTG_HS_GINTSTS) is set. Before the application can read this register, it must first read the host all channels interrupt (OTG_HS_HAINT) register to get the exact channel number for the host channel-x interrupt register. The application must clear the appropriate bit in this register to clear the corresponding bits in the OTG_HS_HAINT and OTG_HS_GINTSTS registers. */

/* [31..11] Reserved, must be kept at reset value. */


/* Bit 10 - Data toggle error */
#define OTG_HS_DTERR (1 << 10)

/* Bit 9 - Frame overrun */
#define OTG_HS_FRMOR (1 << 9)

/* Bit 8 - Babble error */
#define OTG_HS_BBERR (1 << 8)

/* Bit 7 - Transaction error */
#define OTG_HS_TXERR (1 << 7)
/* Indicates one of the following errors occurred on the USB.
- CRC check failure
- Timeout
- Bit stuff error
- False EOP */

