bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
/* Bit 6 - Response received interrupt */
//#define OTG_HS_NYET (1 << 6)
#define OTG_HS_HNYET (1 << 6)

/* Bit 5 - ACK response received/transmitted interrupt */
#define OTG_HS_ACK (1 << 5)

/* Bit 4 - NAK response received interrupt */
//#define OTG_HS_NAK (1 << 4)
#define OTG_HS_HNAK (1 << 4)

/* Bit 3 - STALL response received interrupt */
//#define OTG_HS_STALL (1 << 3)
#define OTG_HS_HSTALL (1 << 3)

/* Bit 2 - AHB error */
#define OTG_HS_AHBERR (1 << 2)
/* This error is generated only in Internal DMA mode when an AHB error occurs during an AHB read/write operation. The application can read the corresponding DMA channel address register to get the error address. */

/* Bit 1 - Channel halted */
#define OTG_HS_CHH (1 << 1)
/* Indicates the transfer completed abnormally either because of any USB transaction error or in response to disable request by the application. */

/* Bit 0 - Transfer completed */
#define OTG_HS_XFRC (1 << 0)
/* Transfer completed normally without any errors. */


/* OTG_HS host channel-x interrupt mask register */
#define STM32F_OTG_HS_HCINTMSKX 0x50C

/* This register reflects the mask for each channel status described in the previous section. */

/* [31..11] Reserved, must be kept at reset value. */


/* Bit 10 - Data toggle error mask */
#define OTG_HS_DTERRM (1 << 10)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 9 - Frame overrun mask */
#define OTG_HS_FRMORM (1 << 9)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 8 - Babble error mask */
#define OTG_HS_BBERRM (1 << 8)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 7 - Transaction error mask */
#define OTG_HS_TXERRM (1 << 7)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 6 - response received interrupt mask */
//#define OTG_HS_NYET (1 << 6)
#define OTG_HS_HNYET (1 << 6)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 5 - ACK response received/transmitted interrupt mask */
#define OTG_HS_ACKM (1 << 5)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 4 - NAK response received interrupt mask */
#define OTG_HS_HNAKM (1 << 4)
//#define OTG_HS_NAKM (1 << 4)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 3 - STALL response received interrupt mask */
#define OTG_HS_STALLM (1 << 3)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 2 - AHB error */
#define OTG_HS_AHBERR (1 << 2)
/* This is generated only in Internal DMA mode when there is an AHB error during AHB read/write. The application can read the corresponding channel’s DMA address register to get the error address. */

/* Bit 1 - Channel halted mask */
#define OTG_HS_CHHM (1 << 1)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 0 - Transfer completed mask */
#define OTG_HS_XFRCM (1 << 0)
/* 0: Masked interrupt
1: Unmasked interrupt */


/* OTG_HS host channel-x transfer size register */
#define STM32F_OTG_HS_HCTSIZX 0x510



/* Bit 31 - Doping */
#define OTG_HS_DOPING (1 << 31)
/* This bit is used only for OUT transfers. Setting this field to 1 directs the host to do PING protocol.
Note: Do not set this bit for IN transfers. If this bit is set for IN transfers it disables the channel. */

/* Bits [30..29] - Data PID */
//#define OTG_HS_DPID_MSK (((1 << (30 - 29 + 1)) - 1) << 29)
//#define OTG_HS_DPID_SET(VAL) (((VAL) << 29) & OTG_HS_DPID_MSK)
//#define OTG_HS_DPID_GET(REG) (((REG) & OTG_HS_DPID_MSK) >> 29)
#define OTG_HS_HDPID_MSK (((1 << (30 - 29 + 1)) - 1) << 29)
#define OTG_HS_HDPID_SET(VAL) (((VAL) << 29) & OTG_HS_HDPID_MSK)
#define OTG_HS_HDPID_GET(REG) (((REG) & OTG_HS_DPID_MSK) >> 29)
/* The application programs this field with the type of PID to use for the initial transaction. The host maintains this field for the rest of the transfer.
00: DATA0
01: DATA2
10: DATA1
11: MDATA (noncontrol)/SETUP (control) */

/* Bits [28..19] - Packet count */
#define OTG_HS_PKTCNT_MSK (((1 << (28 - 19 + 1)) - 1) << 19)
#define OTG_HS_PKTCNT_SET(VAL) (((VAL) << 19) & OTG_HS_PKTCNT_MSK)
#define OTG_HS_PKTCNT_GET(REG) (((REG) & OTG_HS_PKTCNT_MSK) >> 19)
/* This field is programmed by the application with the expected number of packets to be transmitted (OUT) or received (IN).
The host decrements this count on every successful transmission or reception of an OUT/IN packet. Once this count reaches zero, the application is interrupted to indicate normal completion. */

/* Bits [18..0] - Transfer size */
#define OTG_HS_XFRSIZ_MSK (((1 << (18 - 0 + 1)) - 1) << 0)
#define OTG_HS_XFRSIZ_SET(VAL) (((VAL) << 0) & OTG_HS_XFRSIZ_MSK)
#define OTG_HS_XFRSIZ_GET(REG) (((REG) & OTG_HS_XFRSIZ_MSK) >> 0)
/* For an OUT, this field is the number of data bytes the host sends during the transfer.
For an IN, this field is the buffer size that the application has reserved for the transfer. The application is expected to program this field as an integer multiple of the maximum packet size for IN transactions (periodic and nonperiodic). */


/* OTG_HS host channel-x DMA address register */
#define STM32F_OTG_HS_HCDMAX 0x514



/* Bits [31..0] - DMA address */
#define OTG_HS_DMAADDR_MSK (((1 << (31 - 0 + 1)) - 1) << 0)
#define OTG_HS_DMAADDR_SET(VAL) (((VAL) << 0) & OTG_HS_DMAADDR_MSK)
#define OTG_HS_DMAADDR_GET(REG) (((REG) & OTG_HS_DMAADDR_MSK) >> 0)
/* This field holds the start address in the external memory from which the data for the endpoint must be fetched or to which it must be stored. This register is incremented on every AHB transaction. */





/* Device-mode registers */

/* OTG_HS device configuration register */
#define STM32F_OTG_HS_DCFG 0x800
/* This register configures the core in peripheral mode after power-on or after certain control commands or enumeration. Do not make changes to this register after initial programming. */

/* [31..26] Reserved, must be kept at reset value. */


/* Bits [25..24] - Periodic scheduling interval */
#define OTG_HS_PERSCHIVL_MSK (((1 << (25 - 24 + 1)) - 1) << 24)
#define OTG_HS_PERSCHIVL_SET(VAL) (((VAL) << 24) & OTG_HS_PERSCHIVL_MSK)
#define OTG_HS_PERSCHIVL_GET(REG) (((REG) & OTG_HS_PERSCHIVL_MSK) >> 24)
/* This field specifies the amount of time the Internal DMA engine must allocate for fetching periodic IN endpoint data. Based on the number of periodic endpoints, this value must be specified as 25, 50 or 75% of the (micro)frame.
– When any periodic endpoints are active, the internal DMA engine allocates the specified amount of time in fetching periodic IN endpoint data
– When no periodic endpoint is active, then the internal DMA engine services nonperiodic endpoints, ignoring this field
– After the specified time within a (micro)frame, the DMA switches to fetching nonperiodic endpoints
00: 25% of (micro)frame
01: 50% of (micro)frame
10: 75% of (micro)frame
11: Reserved */

