bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
/* [23..13] Reserved, must be kept at reset value. */


/* Bits [12..11] - Periodic (micro)frame interval */
#define OTG_HS_PFIVL_MSK (((1 << (12 - 11 + 1)) - 1) << 11)
#define OTG_HS_PFIVL_SET(VAL) (((VAL) << 11) & OTG_HS_PFIVL_MSK)
#define OTG_HS_PFIVL_GET(REG) (((REG) & OTG_HS_PFIVL_MSK) >> 11)
#define OTG_HS_PFIVL_80 (0 << 11)
#define OTG_HS_PFIVL_85 (1 << 11)
#define OTG_HS_PFIVL_90 (2 << 11)
#define OTG_HS_PFIVL_95 (3 << 11)
/* Indicates the time within a (micro) frame at which the application must be notified using the end of periodic (micro) frame interrupt. This can be used to determine if all the isochronous traffic for that frame is complete.
00: 80% of the frame interval
01: 85% of the frame interval
10: 90% of the frame interval
11: 95% of the frame interval */

/* Bits [10..4] - Device address */
#define OTG_HS_DAD_MSK (((1 << (10 - 4 + 1)) - 1) << 4)
#define OTG_HS_DAD_SET(VAL) (((VAL) << 4) & OTG_HS_DAD_MSK)
#define OTG_HS_DAD_GET(REG) (((REG) & OTG_HS_DAD_MSK) >> 4)
/* The application must program this field after every SetAddress control command. */

/* Bit 3 Reserved, must be kept at reset value. */


/* Bit 2 - Nonzero-length status OUT handshake */
#define OTG_HS_NZLSOHSK (1 << 2)
/* The application can use this field to select the handshake the core sends on receiving a nonzero-length data packet during the OUT transaction of a control transfer’s Status stage. 1: Send a STALL handshake on a nonzero-length status OUT transaction and do not send
the received OUT packet to the application.
0: Send the received OUT packet to the application (zero-length or nonzero-length) and send a handshake based on the NAK and STALL bits for the endpoint in the device endpoint control register. */

/* Bits [1..0] - Device speed */
#define OTG_HS_DSPD_MSK (((1 << (1 - 0 + 1)) - 1) << 0)
#define OTG_HS_DSPD_SET(VAL) (((VAL) << 0) & OTG_HS_DSPD_MSK)
#define OTG_HS_DSPD_GET(REG) (((REG) & OTG_HS_DSPD_MSK) >> 0)
#define OTG_HS_DSPD_HIGH     (0x0 << 0)
#define OTG_HS_DSPD_FULL_EXT (0x1 << 0)
#define OTG_HS_DSPD_FULL_INT (0x3 << 0)
#define OTG_HS_DSPD_FULL     OTG_HS_DSPD_FULL_INT 

/* Indicates the speed at which the application requires the core to enumerate, or the maximum speed the application can support. However, the actual bus speed is determined only after the chirp sequence is completed, and is based on the speed of the USB host to which the core is connected.
00: High speed
01: Full speed using external ULPI PHY
10: Reserved
11: Full speed using internal embedded PHY */


/* OTG_HS device control register */
#define STM32F_OTG_HS_DCTL 0x804



/* [31..12] Reserved, must be kept at reset value. */


/* Bit 11 - Power-on programming done */
#define OTG_HS_POPRGDNE (1 << 11)
/* The application uses this bit to indicate that register programming is completed after a wakeup from power down mode. */

/* Bit 10 - Clear global OUT NAK */
#define OTG_HS_CGONAK (1 << 10)
/* A write to this field clears the Global OUT NAK. */

/* Bit 9 - Set global OUT NAK */
#define OTG_HS_SGONAK (1 << 9)
/* A write to this field sets the Global OUT NAK.
The application uses this bit to send a NAK handshake on all OUT endpoints.
The application must set the this bit only after making sure that the Global OUT NAK effective bit in the Core interrupt register (GONAKEFF bit in OTG_HS_GINTSTS) is cleared. */

/* Bit 8 - Clear global IN NAK */
#define OTG_HS_CGINAK (1 << 8)
/* A write to this field clears the Global IN NAK. */

/* Bit 7 - Set global IN NAK */
#define OTG_HS_SGINAK (1 << 7)
/* A write to this field sets the Global nonperiodic IN NAK.The application uses this bit to send a NAK handshake on all nonperiodic IN endpoints.
The application must set this bit only after making sure that the Global IN NAK effective bit in the Core interrupt register (GINAKEFF bit in OTG_HS_GINTSTS) is cleared. */

/* Bits [6..4] - Test control */
#define OTG_HS_TCTL_MSK (((1 << (6 - 4 + 1)) - 1) << 4)
#define OTG_HS_TCTL_SET(VAL) (((VAL) << 4) & OTG_HS_TCTL_MSK)
#define OTG_HS_TCTL_GET(REG) (((REG) & OTG_HS_TCTL_MSK) >> 4)
/* 000: Test mode disabled
001: Test_J mode
010: Test_K mode
011: Test_SE0_NAK mode
100: Test_Packet mode
101: Test_Force_Enable
Others: Reserved */

/* Bit 3 - Global OUT NAK status */
#define OTG_HS_GONSTS (1 << 3)
/* 0: A handshake is sent based on the FIFO Status and the NAK and STALL bit settings.
1: No data is written to the RxFIFO, irrespective of space availability. Sends a NAK handshake on all packets, except on SETUP transactions. All isochronous OUT packets are dropped. */

/* Bit 2 - Global IN NAK status */
#define OTG_HS_GINSTS (1 << 2)
/* 0: A handshake is sent out based on the data availability in the transmit FIFO.
1: A NAK handshake is sent out on all nonperiodic IN endpoints, irrespective of the data availability in the transmit FIFO. */

/* Bit 1 - Soft disconnect */
#define OTG_HS_SDIS (1 << 1)
/* The application uses this bit to signal the USB OTG core to perform a soft disconnect. As long as this bit is set, the host does not see that the device is connected, and the device does not receive signals on the USB. The core stays in the disconnected state until the application clears this bit.
0: Normal operation. When this bit is cleared after a soft disconnect, the core generates a device connect event to the USB host. When the device is reconnected, the USB host restarts device enumeration.
1: The core generates a device disconnect event to the USB host. */

/* Bit 0 - Remote wakeup signaling */
#define OTG_HS_RWUSIG (1 << 0)
/* When the application sets this bit, the core initiates remote signaling to wake up the USB host. The application must set this bit to instruct the core to exit the Suspend state. As specified in the USB 2.0 specification, the application must clear this bit 1 ms to 15 ms after
setting it.
Table 209 contains the minimum duration (according to device state) for which the Soft disconnect (SDIS) bit must be set for the USB host to detect a device disconnect. To accommodate clock jitter, it is recommended that the application add some extra delay to the specified minimum duration.
Table 209. Minimum duration for soft disconnect
Operating speed Device state Minimum duration
High speed Not Idle or Suspended (Performing transactions) 125 μs
Full speed Suspended 1 ms + 2.5 μs
Full speed Idle 2.5 μs
Full speed Not Idle or Suspended (Performing transactions) 2.5 μs */


/* OTG_HS device status register */
#define STM32F_OTG_HS_DSTS 0x808
/* This register indicates the status of the core with respect to USB-related events. It must be read on interrupts from the device all interrupts (OTG_HS_DAINT) register. */

