bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
/* [31..22] Reserved, must be kept at reset value. */


/* Bits [21..8] - Frame number of the received SOF */
#define OTG_HS_FNSOF_MSK (((1 << (21 - 8 + 1)) - 1) << 8)
#define OTG_HS_FNSOF_SET(VAL) (((VAL) << 8) & OTG_HS_FNSOF_MSK)
#define OTG_HS_FNSOF_GET(REG) (((REG) & OTG_HS_FNSOF_MSK) >> 8)

/* [7..4] Reserved, must be kept at reset value. */


/* Bit 3 - Erratic error */
#define OTG_HS_EERR (1 << 3)
/* The core sets this bit to report any erratic errors.
Due to erratic errors, the OTG_HS controller goes into Suspended state and an interrupt is generated to the application with Early suspend bit of the Core interrupt register (ESUSP bit in OTG_HS_GINTSTS). If the early suspend is asserted due to an erratic error, the application can only perform a soft disconnect recover. */

/* Bits [2..1] - Enumerated speed */
#define OTG_HS_ENUMSPD_MSK (((1 << (2 - 1 + 1)) - 1) << 1)
#define OTG_HS_ENUMSPD_SET(VAL) (((VAL) << 1) & OTG_HS_ENUMSPD_MSK)
#define OTG_HS_ENUMSPD_GET(REG) (((REG) & OTG_HS_ENUMSPD_MSK) >> 1)
/* Indicates the speed at which the OTG_HS controller has come up after speed detection through a chirp sequence.
00: High speed
01: Reserved
10: Reserved
11: Full speed (PHY clock is running at 48 MHz)
Others: reserved */

/* Bit 0 - Suspend status */
#define OTG_HS_SUSPSTS (1 << 0)
/* In peripheral mode, this bit is set as long as a Suspend condition is detected on the USB. 
The core enters the Suspended state when there is no activity on the USB data lines for a period of 3 ms. The core comes out of the suspend:
– When there is an activity on the USB data lines
– When the application writes to the Remote wakeup signaling bit in the Device control register (RWUSIG bit in OTG_HS_DCTL). */


/* OTG_HS device IN endpoint common interrupt mask register */
#define STM32F_OTG_HS_DIEPMSK 0x810
/* This register works with each of the Device IN endpoint interrupt (OTG_HS_D    IEPINTx) registers for all endpoints to generate an interrupt per IN endpoint. The IN endpoint interrupt for a specific status in the OTG_HS_DIEPINTx register can be masked by writing to the corresponding bit in this register. Status bits are masked by default. */

/* [31..10] Reserved, must be kept at reset value. */


/* Bit 9 - BNA interrupt mask */
#define OTG_HS_BIM (1 << 9)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 8 - FIFO underrun mask */
#define OTG_HS_TXFURM (1 << 8)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 7 Reserved, must be kept at reset value. */


/* Bit 6 - IN endpoint NAK effective mask */
#define OTG_HS_INEPNEM (1 << 6)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 5 - IN token received with EP mismatch mask */
#define OTG_HS_INEPNMM (1 << 5)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 4 - IN token received when TxFIFO empty mask */
#define OTG_HS_ITTXFEMSK (1 << 4)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 3 - Timeout condition mask (nonisochronous endpoints) */
#define OTG_HS_TOM (1 << 3)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 2 Reserved, must be kept at reset value. */


/* Bit 1 - Endpoint disabled interrupt mask */
#define OTG_HS_EPDM (1 << 1)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 0 - Transfer completed interrupt mask */
#define OTG_HS_XFRCM (1 << 0)
/* 0: Masked interrupt
1: Unmasked interrupt */


/* OTG_HS device OUT endpoint common interrupt mask register */
#define STM32F_OTG_HS_DOEPMSK 0x814
/* This register works with each of the Device OUT endpoint interrupt (OTG_HS_DOEPINTx) registers for all endpoints to generate an interrupt per OUT endpoint. The OUT endpoint interrupt for a specific status in the OTG_HS_DOEPINTx register can be masked by writing into the corresponding bit in this register. Status bits are masked by default. */

/* [31..10] Reserved, must be kept at reset value. */


/* Bit 9 - BNA interrupt mask */
#define OTG_HS_BOIM (1 << 9)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 8 - OUT packet error mask */
#define OTG_HS_OPEM (1 << 8)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 7 Reserved, must be kept at reset value. */


/* Bit 6 - Back-to-back SETUP packets received mask */
#define OTG_HS_B2BSTUP (1 << 6)
/* Applies to control OUT endpoints only.
0: Masked interrupt
1: Unmasked interrupt */

/* Bit 5 Reserved, must be kept at reset value. */


/* Bit 4 - OUT token received when endpoint disabled mask */
#define OTG_HS_OTEPDM (1 << 4)
/* Applies to control OUT endpoints only.
0: Masked interrupt
1: Unmasked interrupt */

/* Bit 3 - SETUP phase done mask */
#define OTG_HS_STUPM (1 << 3)
/* Applies to control endpoints only.
0: Masked interrupt
1: Unmasked interrupt */

/* Bit 2 Reserved, must be kept at reset value. */


/* Bit 1 - Endpoint disabled interrupt mask */
#define OTG_HS_EPDM (1 << 1)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 0 - Transfer completed interrupt mask */
#define OTG_HS_XFRCM (1 << 0)
/* 0: Masked interrupt
1: Unmasked interrupt */


/* OTG_HS device all endpoints interrupt register */
#define STM32F_OTG_HS_DAINT 0x818
/* When a significant event occurs on an endpoint, a device all endpoints interrupt register interrupts the application using the Device OUT endpoints interrupt bit or Device IN endpoints interrupt bit of the Core interrupt register (OEPINT or IEPINT in OTG_HS_GINTSTS, respectively). There is one interrupt bit per endpoint, up to a maximum of 16 bits for OUT endpoints and 16 bits for IN endpoints. For a bidirectional endpoint, the corresponding IN and OUT interrupt bits are used. Bits in this register are set and cleared when the application sets and clears bits in the corresponding Device Endpoint-x interrupt
register (OTG_HS_DIEPINTx/OTG_HS_DOEPINTx). */

/* Bits [31..16] - OUT endpoint interrupt bits */
#define OTG_HS_OEPINT_MASK_MSK (((1 << (31 - 16 + 1)) - 1) << 16)
#define OTG_HS_OEPINT_MASK_SET(VAL) (((VAL) << 16) & OTG_HS_OEPINT_MASK_MSK)
#define OTG_HS_OEPINT_MASK_GET(REG) (((REG) & OTG_HS_OEPINT_MASK_MSK) >> 16)
#define OTG_HS_OEPINT0  (1 << 16)
#define OTG_HS_OEPINT1  (1 << 17)
#define OTG_HS_OEPINT2  (1 << 18)
#define OTG_HS_OEPINT3  (1 << 19)
#define OTG_HS_OEPINT4  (1 << 20)
#define OTG_HS_OEPINT5  (1 << 21)
#define OTG_HS_OEPINT6  (1 << 22)
#define OTG_HS_OEPINT7  (1 << 23)
#define OTG_HS_OEPINT8  (1 << 24)
#define OTG_HS_OEPINT9  (1 << 25)
#define OTG_HS_OEPINT10 (1 << 26)
#define OTG_HS_OEPINT11 (1 << 27)
#define OTG_HS_OEPINT12 (1 << 28)
#define OTG_HS_OEPINT13 (1 << 29)
#define OTG_HS_OEPINT14 (1 << 30)
#define OTG_HS_OEPINT15 (1 << 31)
/* One bit per OUT endpoint:
Bit 16 for OUT endpoint 0, bit 31 for OUT endpoint 15 */

/* Bits [15..0] - IN endpoint interrupt bits */
#define OTG_HS_IEPINT_MASK_MSK (((1 << (15 - 0 + 1)) - 1) << 0)
#define OTG_HS_IEPINT_MASK_SET(VAL) (((VAL) << 0) & OTG_HS_IEPINT_MASK_MSK)
#define OTG_HS_IEPINT_MASK_GET(REG) (((REG) & OTG_HS_IEPINT_MASK_MSK) >> 0)
#define OTG_HS_IEPINT0  (1 << 0)
#define OTG_HS_IEPINT1  (1 << 1)
#define OTG_HS_IEPINT2  (1 << 2)
#define OTG_HS_IEPINT3  (1 << 3)
#define OTG_HS_IEPINT4  (1 << 4)
#define OTG_HS_IEPINT5  (1 << 5)
#define OTG_HS_IEPINT6  (1 << 6)
#define OTG_HS_IEPINT7  (1 << 7)
#define OTG_HS_IEPINT8  (1 << 8)
#define OTG_HS_IEPINT9  (1 << 9)
#define OTG_HS_IEPINT10 (1 << 10)
#define OTG_HS_IEPINT11 (1 << 11)
#define OTG_HS_IEPINT12 (1 << 12)
#define OTG_HS_IEPINT13 (1 << 13)
#define OTG_HS_IEPINT14 (1 << 14)
#define OTG_HS_IEPINT15 (1 << 15)
/* One bit per IN endpoint:
Bit 0 for IN endpoint 0, bit 15 for endpoint 15 */


