bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
/* OTG_HS all endpoints interrupt mask register */
#define STM32F_OTG_HS_DAINTMSK 0x81C
/* The device endpoint interrupt mask register works with the device endpoint interrupt register to interrupt the application when an event occurs on a device endpoint. However, the device all endpoints interrupt (OTG_HS_DAINT) register bit corresponding to that interrupt is still set. */

/* Bits [31..16] - OUT EP interrupt mask bits */
#define OTG_HS_OEPM_MSK (((1 << (31 - 16 + 1)) - 1) << 16)
#define OTG_HS_OEPM_SET(VAL) (((VAL) << 16) & OTG_HS_OEPM_MSK)
#define OTG_HS_OEPM_GET(REG) (((REG) & OTG_HS_OEPM_MSK) >> 16)
#define OTG_HS_OEPM(N) (1 << (16 + (N)))
#define OTG_HS_OEPM0  (1 << 16)
#define OTG_HS_OEPM1  (1 << 17)
#define OTG_HS_OEPM2  (1 << 18)
#define OTG_HS_OEPM3  (1 << 19)
#define OTG_HS_OEPM4  (1 << 20)
#define OTG_HS_OEPM5  (1 << 21)
#define OTG_HS_OEPM6  (1 << 22)
#define OTG_HS_OEPM7  (1 << 23)
#define OTG_HS_OEPM8  (1 << 24)
#define OTG_HS_OEPM9  (1 << 25)
#define OTG_HS_OEPM10 (1 << 26)
#define OTG_HS_OEPM11 (1 << 27)
#define OTG_HS_OEPM12 (1 << 28)
#define OTG_HS_OEPM13 (1 << 29)
#define OTG_HS_OEPM14 (1 << 30)
#define OTG_HS_OEPM15 (1 << 31)
/* One per OUT endpoint:
Bit 16 for OUT EP 0, bit 18 for OUT EP 3
0: Masked interrupt
1: Unmasked interrupt */

/* Bits [15..0] - IN EP interrupt mask bits */
#define OTG_HS_IEPM_MSK (((1 << (15 - 0 + 1)) - 1) << 0)
#define OTG_HS_IEPM_SET(VAL) (((VAL) << 0) & OTG_HS_IEPM_MSK)
#define OTG_HS_IEPM_GET(REG) (((REG) & OTG_HS_IEPM_MSK) >> 0)
#define OTG_HS_IEPM(N) (1 << (N))
#define OTG_HS_IEPM0  (1 << 0)
#define OTG_HS_IEPM1  (1 << 1)
#define OTG_HS_IEPM2  (1 << 2)
#define OTG_HS_IEPM3  (1 << 3)
#define OTG_HS_IEPM4  (1 << 4)
#define OTG_HS_IEPM5  (1 << 5)
#define OTG_HS_IEPM6  (1 << 6)
#define OTG_HS_IEPM7  (1 << 7)
#define OTG_HS_IEPM8  (1 << 8)
#define OTG_HS_IEPM9  (1 << 9)
#define OTG_HS_IEPM10 (1 << 10)
#define OTG_HS_IEPM11 (1 << 11)
#define OTG_HS_IEPM12 (1 << 12)
#define OTG_HS_IEPM13 (1 << 13)
#define OTG_HS_IEPM14 (1 << 14)
#define OTG_HS_IEPM15 (1 << 15)
/* One bit per IN endpoint:
Bit 0 for IN EP 0, bit 3 for IN EP 3
0: Masked interrupt
1: Unmasked interrupt */


/* OTG_HS device V BUS discharge time register */
#define STM32F_OTG_HS_DVBUSDIS 0x0828
/* This register specifies the V BUS discharge time after V BUS pulsing during SRP. */

/* [31..16] Reserved, must be kept at reset value. */


/* Bits [15..0] - Device V BUS discharge time */
#define OTG_HS_VBUSDT_MSK (((1 << (15 - 0 + 1)) - 1) << 0)
#define OTG_HS_VBUSDT_SET(VAL) (((VAL) << 0) & OTG_HS_VBUSDT_MSK)
#define OTG_HS_VBUSDT_GET(REG) (((REG) & OTG_HS_VBUSDT_MSK) >> 0)
/* Specifies the V BUS discharge time after V BUS pulsing during SRP. This value equals:
V BUS discharge time in PHY clocks / 1 024
Depending on your V BUS load, this value may need adjusting. */


/* OTG_HS device V BUS pulsing time register */
#define STM32F_OTG_HS_DVBUSPULSE 0x082C
/* This register specifies the V BUS pulsing time during SRP. */

/* [31..12] Reserved, must be kept at reset value. */


/* Bits [11..0] - Device V BUS pulsing time */
#define OTG_HS_DVBUSP_MSK (((1 << (11 - 0 + 1)) - 1) << 0)
#define OTG_HS_DVBUSP_SET(VAL) (((VAL) << 0) & OTG_HS_DVBUSP_MSK)
#define OTG_HS_DVBUSP_GET(REG) (((REG) & OTG_HS_DVBUSP_MSK) >> 0)
/* Specifies the V BUS pulsing time during SRP. This value equals:
V BUS pulsing time in PHY clocks / 1 024 */


/* OTG_HS Device threshold control register */
#define STM32F_OTG_HS_DTHRCTL 0x0830



/* [31..28] Reserved, must be kept at reset value. */


/* Bit 27 - Arbiter parking enable */
#define OTG_HS_ARPEN (1 << 27)
/* This bit controls internal DMA arbiter parking for IN endpoints. When thresholding is enabled and this bit is set to one, then the arbiter parks on the IN endpoint for which there is a token received on the USB. This is done to avoid getting into underrun conditions. By default parking is enabled.
Bit 26
Reserved, must be kept at reset value.
Bits 25: 17 RXTHRLEN: Receive threshold length
This field specifies the receive thresholding size in DWORDS. This field also specifies the amount of data received on the USB before the core can start transmitting on the AHB. The threshold length has to be at least eight DWORDS. The recommended value for RXTHRLEN is to be the same as the programmed AHB burst length (HBSTLEN bit in OTG_HS_GAHBCFG). */

/* Bit 16 - Receive threshold enable */
#define OTG_HS_RXTHREN (1 << 16)
/* When this bit is set, the core enables thresholding in the receive direction.
Bits 15: 11
Reserved, must be kept at reset value. */

/* Bits [10..2] - Transmit threshold length */
#define OTG_HS_TXTHRLEN_MSK (((1 << (10 - 2 + 1)) - 1) << 2)
#define OTG_HS_TXTHRLEN_SET(VAL) (((VAL) << 2) & OTG_HS_TXTHRLEN_MSK)
#define OTG_HS_TXTHRLEN_GET(REG) (((REG) & OTG_HS_TXTHRLEN_MSK) >> 2)
/* This field specifies the transmit thresholding size in DWORDS. This field specifies the amount of data in bytes to be in the corresponding endpoint transmit FIFO, before the core can start transmitting on the USB. The threshold length has to be at least eight DWORDS. This field controls both isochronous and nonisochronous IN endpoint thresholds. The recommended value for TXTHRLEN is to be the same as the programmed AHB burst length (HBSTLEN bit in OTG_HS_GAHBCFG). */

/* Bit 1 - ISO IN endpoint threshold enable */
#define OTG_HS_ISOTHREN (1 << 1)
/* When this bit is set, the core enables thresholding for isochronous IN endpoints. */

/* Bit 0 - Nonisochronous IN endpoints threshold enable */
#define OTG_HS_NONISOTHREN (1 << 0)
/* When this bit is set, the core enables thresholding for nonisochronous IN endpoints. */


/* OTG_HS device IN endpoint FIFO empty interrupt mask register: */
#define STM32F_OTG_HS_DIEPEMPMSK 0x834

/* This register is used to control the IN endpoint FIFO empty interrupt generation (TXFE_OTG_HS_DIEPINTx). */

/* [31..16] Reserved, must be kept at reset value. */


/* Bits [15..0] - IN EP Tx FIFO empty interrupt mask bits */
#define OTG_HS_INEPTXFEM_MSK (((1 << (15 - 0 + 1)) - 1) << 0)
#define OTG_HS_INEPTXFEM_SET(VAL) (((VAL) << 0) & OTG_HS_INEPTXFEM_MSK)
#define OTG_HS_INEPTXFEM_GET(REG) (((REG) & OTG_HS_INEPTXFEM_MSK) >> 0)
/* These bits act as mask bits for OTG_HS_DIEPINTx.
TXFE interrupt one bit per IN endpoint:
Bit 0 for IN endpoint 0, bit 15 for IN endpoint 15
0: Masked interrupt
1: Unmasked interrupt */


/* OTG_HS device each endpoint interrupt register */
#define STM32F_OTG_HS_DEACHINT 0x0838

/* There is one interrupt bit for endpoint 1 IN and one interrupt bit for endpoint 1 OUT. */

