bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
/* [31..18] Reserved, must be kept at reset value. */

/* Bit 17 - OUT endpoint 1 interrupt bit */
#define OTG_HS_OEP1INT (1 << 17)

/* [16..2] Reserved, must be kept at reset value. */


/* Bit 1 - IN endpoint 1interrupt bit */
#define OTG_HS_IEP1INT (1 << 1)

/* OTG_HS device each endpoint interrupt register mask */
#define STM32F_OTG_HS_DEACHINTMSK 0x083C

/* There is one interrupt bit for endpoint 1 IN and one interrupt bit for endpoint 1 OUT. */

/* [31..18] Reserved, must be kept at reset value. */


/* Bit 17 - OUT Endpoint 1 interrupt mask bit */
#define OTG_HS_OEP1INTM (1 << 17)
/* Bits 16:2
Reserved, must be kept at reset value. */

/* Bit 1 - IN Endpoint 1 interrupt mask bit */
#define OTG_HS_IEP1INTM (1 << 1)
/* Bit 0
Reserved, must be kept at reset value. */


/* OTG_HS device each in endpoint-1 interrupt register */
#define STM32F_OTG_HS_DIEPEACHMSK1 0x844



/* [31..14] Reserved, must be kept at reset value. */


/* Bit 13 - NAK interrupt mask */
#define OTG_HS_NAKM (1 << 13)
/* 0: Masked interrupt
1: unmasked interrupt */

/* [12..10] Reserved, must be kept at reset value. */


/* Bit 9 - BNA interrupt mask */
#define OTG_HS_BIM (1 << 9)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 8 - FIFO underrun mask */
#define OTG_HS_TXFURM (1 << 8)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 7 Reserved, must be kept at reset value. */


/* Bit 6 - IN endpoint NAK effective mask */
#define OTG_HS_INEPNEM (1 << 6)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 5 - IN token received with EP mismatch mask */
#define OTG_HS_INEPNMM (1 << 5)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 4 - IN token received when TxFIFO empty mask */
#define OTG_HS_ITTXFEMSK (1 << 4)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 3 - Timeout condition mask (nonisochronous endpoints) */
#define OTG_HS_TOM (1 << 3)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 2 Reserved, must be kept at reset value. */


/* Bit 1 - Endpoint disabled interrupt mask */
#define OTG_HS_EPDM (1 << 1)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 0 - Transfer completed interrupt mask */
#define OTG_HS_XFRCM (1 << 0)
/* 0: Masked interrupt
1: Unmasked interrupt */


/* OTG_HS device each OUT endpoint-1 interrupt register */
#define STM32F_OTG_HS_DOEPEACHMSK1 0x884



/* [31..15] Reserved, must be kept at reset value. */


/* Bit 14 - NYET interrupt mask */
#define OTG_HS_NYETM (1 << 14)
/* 0: Masked interrupt
1: unmasked interrupt */

/* Bit 13 - NAK interrupt mask */
#define OTG_HS_NAKM (1 << 13)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 12 - Bubble error interrupt mask */
#define OTG_HS_BERRM (1 << 12)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* [11..10] Reserved, must be kept at reset value. */


/* Bit 9 - BNA interrupt mask */
#define OTG_HS_BIM (1 << 9)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 8 - OUT packet error mask */
#define OTG_HS_OPEM (1 << 8)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* [7..3] Reserved, must be kept at reset value. */


/* Bit 2 - AHB error mask */
#define OTG_HS_AHBERRM (1 << 2)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 1 - Endpoint disabled interrupt mask */
#define OTG_HS_EPDM (1 << 1)
/* 0: Masked interrupt
1: Unmasked interrupt */

/* Bit 0 - Transfer completed interrupt mask */
#define OTG_HS_XFRCM (1 << 0)
/* 0: Masked interrupt
1: Unmasked interrupt */


/* OTG device endpoint-x control register */
#define STM32F_OTG_HS_DIEPCTLX 0x900

/* The application uses this register to control the behavior of each logical endpoint other than endpoint 0. */

/* Bit 31 - Endpoint enable */
#define OTG_HS_EPENA (1 << 31)
/* The application sets this bit to start transmitting data on an endpoint.
The core clears this bit before setting any of the following interrupts on this endpoint:
– SETUP phase done
– Endpoint disabled
– Transfer completed */

/* Bit 30 - Endpoint disable */
#define OTG_HS_EPDIS (1 << 30)
/* The application sets this bit to stop transmitting/receiving data on an endpoint, even before the transfer for that endpoint is complete. The application must wait for the Endpoint disabled interrupt before treating the endpoint as disabled. The core clears this bit before setting the Endpoint disabled interrupt. The application must set this bit only if Endpoint enable is already set for this endpoint. */

/* Bit 29 - Set odd frame */
#define OTG_HS_SODDFRM (1 << 29)
/* Applies to isochronous IN and OUT endpoints only.
Writing to this field sets the Even/Odd frame (EONUM) field to odd frame. */

/* Bit 28 - Set DATA0 PID */
#define OTG_HS_SD0PID (1 << 28)
/* Applies to interrupt/bulk IN endpoints only.
Writing to this field sets the endpoint data PID (DPID) field in this register to DATA0.
SEVNFRM: Set even frame
Applies to isochronous IN endpoints only.
Writing to this field sets the Even/Odd frame (EONUM) field to even frame. */

/* Bit 27  - Set NAK */
#define OTG_HS_SNAK (1 << 27)
/* A write to this bit sets the NAK bit for the endpoint.
Using this bit, the application can control the transmission of NAK handshakes on an endpoint. The core can also set this bit for OUT endpoints on a Transfer completed interrupt, or after a SETUP is received on the endpoint. */

/* Bit 26 - Clear NAK */
#define OTG_HS_CNAK (1 << 26)
/* A write to this bit clears the NAK bit for the endpoint. */

/* Bits [25..22] - TxFIFO number */
#define OTG_HS_TXFNUM_MSK (((1 << (25 - 22 + 1)) - 1) << 22)
#define OTG_HS_TXFNUM_SET(VAL) (((VAL) << 22) & OTG_HS_TXFNUM_MSK)
#define OTG_HS_TXFNUM_GET(REG) (((REG) & OTG_HS_TXFNUM_MSK) >> 22)
/* These bits specify the FIFO number associated with this endpoint. Each active IN endpoint must be programmed to a separate FIFO number.
This field is valid only for IN endpoints. */

/* Bit 21 - STALL handshake */
#define OTG_HS_STALL (1 << 21)
/* Applies to noncontrol, nonisochronous IN endpoints only (access type is rw).
The application sets this bit to stall all tokens from the USB host to this endpoint. If a NAK bit, Global IN NAK, or Global OUT NAK is set along with this bit, the STALL bit takes priority.
Only the application can clear this bit, never the core.
Applies to control endpoints only (access type is rs).
The application can only set this bit, and the core clears it, when a SETUP token is received for this endpoint. If a NAK bit, Global IN NAK, or Global OUT NAK is set along with this bit, the STALL bit takes priority. Irrespective of this bit’s setting, the core always responds to SETUP data packets with an ACK handshake. */

/* Bit 20 Reserved, must be kept at reset value. */


/* Bits [19..18] - Endpoint type */
#define OTG_HS_EPTYP_MSK (((1 << (19 - 18 + 1)) - 1) << 18)
#define OTG_HS_EPTYP_SET(VAL) (((VAL) << 18) & OTG_HS_EPTYP_MSK)
#define OTG_HS_EPTYP_GET(REG) (((REG) & OTG_HS_EPTYP_MSK) >> 18)
/* This is the transfer type supported by this logical endpoint.
00: Control
01: Isochronous
10: Bulk
11: Interrupt */

/* Bit 17 - NAK status */
#define OTG_HS_NAKSTS (1 << 17)
/* It indicates the following:
0: The core is transmitting nonNAK handshakes based on the FIFO status.
1: The core is transmitting NAK handshakes on this endpoint.
When either the application or the core sets this bit:
For nonisochronous IN endpoints: The core stops transmitting any data on an IN endpoint, even if there are data available in the TxFIFO.
For isochronous IN endpoints: The core sends out a zero-length data packet, even if there are data available in the TxFIFO.
Irrespective of this bit’s setting, the core always responds to SETUP data packets with an ACK handshake. */

