bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
/* Bit 16 - Even/odd frame */
#define OTG_HS_EONUM (1 << 16)
/* Applies to isochronous IN endpoints only.
Indicates the frame number in which the core transmits/receives isochronous data for this endpoint. The application must program the even/odd frame number in which it intends to transmit/receive isochronous data for this endpoint using the SEVNFRM and SODDFRM fields in this register.
0: Even frame
1: Odd frame
DPID: Endpoint data PID
Applies to interrupt/bulk IN endpoints only.
Contains the PID of the packet to be received or transmitted on this endpoint. The application must program the PID of the first packet to be received or transmitted on this endpoint, after the endpoint is activated. The application uses the SD0PID register field to program either DATA0 or DATA1 PID.
0: DATA0
1: DATA1 */

/* Bit 15 - USB active endpoint */
#define OTG_HS_USBAEP (1 << 15)
/* Indicates whether this endpoint is active in the current configuration and interface. The core clears this bit for all endpoints (other than EP 0) after detecting a USB reset. After receiving the SetConfiguration and SetInterface commands, the application must program endpoint registers accordingly and set this bit. */

/* [14..11] Reserved, must be kept at reset value. */


/* Bits [10..0] - Maximum packet size */
#define OTG_HS_MPSIZ_MSK (((1 << (10 - 0 + 1)) - 1) << 0)
#define OTG_HS_MPSIZ_SET(VAL) (((VAL) << 0) & OTG_HS_MPSIZ_MSK)
#define OTG_HS_MPSIZ_GET(REG) (((REG) & OTG_HS_MPSIZ_MSK) >> 0)
/* The application must program this field with the maximum packet size for the current logical endpoint. This value is in bytes. */


/* OTG_HS device control OUT endpoint 0 control register */
#define STM32F_OTG_HS_DOEPCTL0 0xB00

/* This section describes the device control OUT endpoint 0 control register. Nonzero control endpoints use registers for endpoints 1–15. */

/* Bit 31 - Endpoint enable */
#define OTG_HS_EPENA (1 << 31)
/* The application sets this bit to start transmitting data on endpoint 0.
The core clears this bit before setting any of the following interrupts on this endpoint:
– SETUP phase done
– Endpoint disabled
– Transfer completed */

/* Bit 30 - Endpoint disable */
#define OTG_HS_EPDIS (1 << 30)
/* The application cannot disable control OUT endpoint 0. */

/* [29..28] Reserved, must be kept at reset value. */


/* Bit 27 - Set NAK */
#define OTG_HS_SNAK (1 << 27)
/* A write to this bit sets the NAK bit for the endpoint.
Using this bit, the application can control the transmission of NAK handshakes on an endpoint. The core can also set this bit on a Transfer completed interrupt, or after a SETUP is received on the endpoint. */

/* Bit 26 - Clear NAK */
#define OTG_HS_CNAK (1 << 26)
/* A write to this bit clears the NAK bit for the endpoint. */

/* [25..22] Reserved, must be kept at reset value. */


/* Bit 21 - STALL handshake */
#define OTG_HS_STALL (1 << 21)
/* The application can only set this bit, and the core clears it, when a SETUP token is received for this endpoint. If a NAK bit or Global OUT NAK is set along with this bit, the STALL bit takes priority. Irrespective of this bit’s setting, the core always responds to SETUP data
packets with an ACK handshake. */

/* Bit 20 - Snoop mode */
#define OTG_HS_SNPM (1 << 20)
/* This bit configures the endpoint to Snoop mode. In Snoop mode, the core does not check the correctness of OUT packets before transferring them to application memory. */

/* Bits [19..18] - Endpoint type */
#define OTG_HS_EPTYP_MSK (((1 << (19 - 18 + 1)) - 1) << 18)
#define OTG_HS_EPTYP_SET(VAL) (((VAL) << 18) & OTG_HS_EPTYP_MSK)
#define OTG_HS_EPTYP_GET(REG) (((REG) & OTG_HS_EPTYP_MSK) >> 18)
/* Hardcoded to 2’b00 for control. */

/* Bit 17 - NAK status */
#define OTG_HS_NAKSTS (1 << 17)
/* Indicates the following:
0: The core is transmitting nonNAK handshakes based on the FIFO status.
1: The core is transmitting NAK handshakes on this endpoint.
When either the application or the core sets this bit, the core stops receiving data, even if there is space in the RxFIFO to accommodate the incoming packet. Irrespective of this bit’s setting, the core always responds to SETUP data packets with an ACK handshake. */

/* Bit 16 Reserved, must be kept at reset value. */


/* Bit 15 - USB active endpoint */
#define OTG_HS_USBAEP (1 << 15)
/* This bit is always set to 1, indicating that a control endpoint 0 is always active in all configurations and interfaces. */

/* [14..2] Reserved, must be kept at reset value. */


/* Bits [1..0] - Maximum packet size */
#define OTG_HS_MPSIZ_MSK (((1 << (10 - 0 + 1)) - 1) << 0)
#define OTG_HS_MPSIZ_64 (0 << 0)
#define OTG_HS_MPSIZ_32 (1 << 0)
#define OTG_HS_MPSIZ_16 (2 << 0)
#define OTG_HS_MPSIZ_8  (3 << 0)
/* The maximum packet size for control OUT endpoint 0 is the same as what is programmed in control IN endpoint 0.
00: 64 bytes
01: 32 bytes
10: 16 bytes
11: 8 bytes */

/* OTG_HS device endpoint-x control register (OTG_HS_DOEPCTLx) (x = 1..3, where x = Endpoint_number)
Address offset for OUT endpoints: 0xB00 + (Endpoint_number × 0x20) */
/* The application uses this register to control the behavior of each logical endpoint other than endpoint 0. */

/* Bit 31 - Endpoint enable */
#define OTG_HS_EPENA (1 << 31)
/* Applies to IN and OUT endpoints.
The application sets this bit to start transmitting data on an endpoint.
The core clears this bit before setting any of the following interrupts on this endpoint:
– SETUP phase done
– Endpoint disabled
– Transfer completed */

/* Bit 30 - Endpoint disable */
#define OTG_HS_EPDIS (1 << 30)
/* The application sets this bit to stop transmitting/receiving data on an endpoint, even before the transfer for that endpoint is complete. The application must wait for the Endpoint disabled interrupt before treating the endpoint as disabled. The core clears this bit before setting the Endpoint disabled interrupt. The application must set this bit only if Endpoint enable is already set for this endpoint. */

/* Bit 29 - Set odd frame */
#define OTG_HS_SODDFRM (1 << 29)
/* Applies to isochronous OUT endpoints only.
Writing to this field sets the Even/Odd frame (EONUM) field to odd frame. */

/* Bit 28 - Set DATA0 PID */
#define OTG_HS_SD0PID (1 << 28)
/* Applies to interrupt/bulk OUT endpoints only.
Writing to this field sets the endpoint data PID (DPID) field in this register to DATA0.
SEVNFRM: Set even frame
Applies to isochronous OUT endpoints only.
Writing to this field sets the Even/Odd frame (EONUM) field to even frame. */

