bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
/* Bit 27 - Set NAK */
#define OTG_HS_SNAK (1 << 27)
/* A write to this bit sets the NAK bit for the endpoint.
Using this bit, the application can control the transmission of NAK handshakes on an endpoint. The core can also set this bit for OUT endpoints on a Transfer Completed interrupt, or after a SETUP is received on the endpoint. */

/* Bit 26 - Clear NAK */
#define OTG_HS_CNAK (1 << 26)
/* A write to this bit clears the NAK bit for the endpoint. */

/* [25..22] Reserved, must be kept at reset value. */


/* Bit 21 - STALL handshake */
#define OTG_HS_STALL (1 << 21)
/* Applies to noncontrol, nonisochronous OUT endpoints only (access type is rw).
The application sets this bit to stall all tokens from the USB host to this endpoint. If a NAK bit, Global IN NAK, or Global OUT NAK is set along with this bit, the STALL bit takes priority. Only the application can clear this bit, never the core.
Applies to control endpoints only (access type is rs).
The application can only set this bit, and the core clears it, when a SETUP token is received for this endpoint. If a NAK bit, Global IN NAK, or Global OUT NAK is set along with this bit, the STALL bit takes priority. Irrespective of this bit’s setting, the core always responds to SETUP data packets with an ACK handshake. */

/* Bit 20 - Snoop mode */
#define OTG_HS_SNPM (1 << 20)
/* This bit configures the endpoint to Snoop mode. In Snoop mode, the core does not check the correctness of OUT packets before transferring them to application memory. */

/* Bits [19..18] - Endpoint type */
#define OTG_HS_EPTYP_MSK (((1 << (19 - 18 + 1)) - 1) << 18)
#define OTG_HS_EPTYP_SET(VAL) (((VAL) << 18) & OTG_HS_EPTYP_MSK)
#define OTG_HS_EPTYP_GET(REG) (((REG) & OTG_HS_EPTYP_MSK) >> 18)
/* This is the transfer type supported by this logical endpoint.
00: Control
01: Isochronous
10: Bulk
11: Interrupt */

/* Bit 17 - NAK status */
#define OTG_HS_NAKSTS (1 << 17)
/* Indicates the following:
0: The core is transmitting nonNAK handshakes based on the FIFO status.
1: The core is transmitting NAK handshakes on this endpoint.
When either the application or the core sets this bit:
The core stops receiving any data on an OUT endpoint, even if there is space in the RxFIFO to accommodate the incoming packet.
Irrespective of this bit’s setting, the core always responds to SETUP data packets with an
ACK handshake. */

/* Bit 16 - Even/odd frame */
#define OTG_HS_EONUM (1 << 16)
/* Applies to isochronous IN and OUT endpoints only.
Indicates the frame number in which the core transmits/receives isochronous data for this endpoint. The application must program the even/odd frame number in which it intends to transmit/receive isochronous data for this endpoint using the SEVNFRM and SODDFRM fields in this register.
0: Even frame
1: Odd frame
DPID: Endpoint data PID
Applies to interrupt/bulk OUT endpoints only. Contains the PID of the packet to be received or transmitted on this endpoint. The application must program the PID of the first packet to be received or transmitted on this endpoint, after the endpoint is activated. The application uses the SD0PID register field to program either DATA0 or DATA1 PID.
0: DATA0
1: DATA1 */

/* Bit 15 - USB active endpoint */
#define OTG_HS_USBAEP (1 << 15)
/* Indicates whether this endpoint is active in the current configuration and interface. The core
clears this bit for all endpoints (other than EP 0) after detecting a USB reset. After receiving the SetConfiguration and SetInterface commands, the application must program endpoint registers accordingly and set this bit.  */

/* [14..11] Reserved, must be kept at reset value. */


/* Bits [10..0] - Maximum packet size */
#define OTG_HS_MPSIZ_MSK (((1 << (10 - 0 + 1)) - 1) << 0)
#define OTG_HS_MPSIZ_SET(VAL) (((VAL) << 0) & OTG_HS_MPSIZ_MSK)
#define OTG_HS_MPSIZ_GET(REG) (((REG) & OTG_HS_MPSIZ_MSK) >> 0)
/* The application must program this field with the maximum packet size for the current logical endpoint. This value is in bytes. */


/* OTG_HS device endpoint-x interrupt register */
#define STM32F_OTG_HS_DIEPINTX 0x908

/* This register indicates the status of an endpoint with respect to USB- and AHB-related events. It is shown in Figure 412. The application must read this register when the IN endpoints interrupt bit of the Core interrupt register (IEPINT in OTG_HS_GINTSTS) is set.
Before the application can read this register, it must first read the device all endpoints interrupt (OTG_HS_DAINT) register to get the exact endpoint number for the device endpoint-x interrupt register. The application must clear the appropriate bit in this register to clear the corresponding bits in the OTG_HS_DAINT and OTG_HS_GINTSTS registers. */

/* [31..14] Reserved, must be kept at reset value. */


/* Bit 13 - NAK interrupt */
#define OTG_HS_NAK (1 << 13)
/* The core generates this interrupt when a NAK is transmitted or received by the device. In case of isochronous IN endpoints the interrupt gets generated when a zero length packet is transmitted due to unavailability of data in the Tx FIFO. */

/* Bit 12 - Babble error interrupt */
#define OTG_HS_BERR (1 << 12)
/* Bit 11 - Packet dropped status */
#define OTG_HS_PKTDRPSTS (1 << 11)
/* This bit indicates to the application that an ISOC OUT packet has been dropped. This bit does not have an associated mask bit and does not generate an interrupt. */

/* Bit10 Reserved, must be kept at reset value. */

/* Bit 9 - Buffer not available interrupt */
#define OTG_HS_BNA (1 << 9)
/* The core generates this interrupt when the descriptor accessed is not ready for the Core to process, such as host busy or DMA done. */

/* Bit 8 - Transmit Fifo Underrun (TxfifoUndrn) The core generates this interrupt when it detects a transmit FIFO underrun condition for this endpoint. */
#define OTG_HS_TXFIFOUDRN (1 << 8)
/* Dependency: This interrupt is valid only when Thresholding is enabled */

/* Bit 7 - Transmit FIFO empty */
#define OTG_HS_TXFE (1 << 7)
/* This interrupt is asserted when the TxFIFO for this endpoint is either half or completely empty. The half or completely empty status is determined by the TxFIFO empty level bit in the Core AHB configuration register (TXFELVL bit in OTG_HS_GAHBCFG). */

/* Bit 6 - IN endpoint NAK effective */
#define OTG_HS_INEPNE (1 << 6)
/* This bit can be cleared when the application clears the IN endpoint NAK by writing to the CNAK bit in OTG_HS_DIEPCTLx.
This interrupt indicates that the core has sampled the NAK bit set (either by the application or by the core). The interrupt indicates that the IN endpoint NAK bit set by the application has taken effect in the core.
This interrupt does not guarantee that a NAK handshake is sent on the USB. A STALL bit takes priority over a NAK bit.
Bit 5
Reserved, must be kept at reset value. */

/* Bit 4 - IN token received when TxFIFO is empty */
#define OTG_HS_ITTXFE (1 << 4)
/* Applies to nonperiodic IN endpoints only.
Indicates that an IN token was received when the associated TxFIFO (periodic/nonperiodic) was empty. This interrupt is asserted on the endpoint for which the IN token was received. */

/* Bit 3 - Timeout condition */
#define OTG_HS_TOC (1 << 3)
/* Applies only to Control IN endpoints.
Indicates that the core has detected a timeout condition on the USB for the last IN token on this endpoint.
Bit 2
Reserved, must be kept at reset value. */

/* Bit 1 - Endpoint disabled interrupt */
#define OTG_HS_EPDISD (1 << 1)
/* This bit indicates that the endpoint is disabled per the application’s request. */

