bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
/* Bit 0 - Transfer completed interrupt */
#define OTG_HS_XFRC (1 << 0)
/* This field indicates that the programmed transfer is complete on the AHB as well as on the USB, for this endpoint. */


/* OTG_HS device endpoint-x interrupt register */
#define STM32F_OTG_HS_DOEPINTX 0xB08

/* This register indicates the status of an endpoint with respect to USB- and AHB-related events. It is shown in Figure 412. The application must read this register when the OUT
Endpoints Interrupt bit of the Core interrupt register (OEPINT bit in OTG_HS_GINTSTS) is set. Before the application can read this register, it must first read the device all endpoints interrupt (OTG_HS_DAINT) register to get the exact endpoint number for the device
Endpoint-x interrupt register. The application must clear the appropriate bit in this register to clear the corresponding bits in the OTG_HS_DAINT and OTG_HS_GINTSTS registers. */

/* [31..15] Reserved, must be kept at reset value. */


/* Bit 14 - NYET interrupt */
#define OTG_HS_NYET (1 << 14)
/* The core generates this interrupt when a NYET response is transmitted for a nonisochronous OUT endpoint. */

/* [13..7] Reserved, must be kept at reset value. */


/* Bit 6 - Back-to-back SETUP packets received */
#define OTG_HS_B2BSTUP (1 << 6)
/* Applies to Control OUT endpoint only.
This bit indicates that the core has received more than three back-to-back SETUP packets for this particular endpoint.
Bit 5
Reserved, must be kept at reset value. */

/* Bit 4 - OUT token received when endpoint disabled */
#define OTG_HS_OTEPDIS (1 << 4)
/* Applies only to control OUT endpoint.
Indicates that an OUT token was received when the endpoint was not yet enabled. This interrupt is asserted on the endpoint for which the OUT token was received. */

/* Bit 3 - SETUP phase done */
#define OTG_HS_STUP (1 << 3)
/* Applies to control OUT endpoints only.
Indicates that the SETUP phase for the control endpoint is complete and no more back-to-back SETUP packets were received for the current control transfer. On this interrupt, the application can decode the received SETUP data packet.
Bit 2
Reserved, must be kept at reset value. */

/* Bit 1 - Endpoint disabled interrupt */
#define OTG_HS_EPDISD (1 << 1)
/* This bit indicates that the endpoint is disabled per the application’s request. */

/* Bit 0 - Transfer completed interrupt */
#define OTG_HS_XFRC (1 << 0)
/* This field indicates that the programmed transfer is complete on the AHB as well as on the USB, for this endpoint. */


/* OTG_HS device IN endpoint 0 transfer size register */
#define STM32F_OTG_HS_DIEPTSIZ0 0x910

/* The application must modify this register before enabling endpoint 0. Once endpoint 0 is enabled using the endpoint enable bit in the device control endpoint 0 control registers (EPENA in OTG_HS_DIEPCTL0), the core modifies this register. The application can only read this register once the core has cleared the Endpoint enable bit.
Nonzero endpoints use the registers for endpoints 1–15. */

/* [31..21] Reserved, must be kept at reset value. */


/* Bits [20..19] - Packet count */
//#define OTG_HS_PKTCNT_MSK (((1 << (20 - 19 + 1)) - 1) << 19)
//#define OTG_HS_PKTCNT_SET(VAL) (((VAL) << 19) & OTG_HS_PKTCNT_MSK)
//#define OTG_HS_PKTCNT_GET(REG) (((REG) & OTG_HS_PKTCNT_MSK) >> 19)
#define OTG_HS_PKTCNT0_MSK (((1 << (20 - 19 + 1)) - 1) << 19)
#define OTG_HS_PKTCNT0(VAL) (((VAL) << 19) & OTG_HS_PKTCNT0_MSK)
#define OTG_HS_PKTCNT0_GET(REG) (((REG) & OTG_HS_PKTCNT0_MSK) >> 19)
/* Indicates the total number of USB packets that constitute the Transfer Size amount of data for endpoint 0.
This field is decremented every time a packet (maximum size or short packet) is read from the TxFIFO. */

/* [18..7] Reserved, must be kept at reset value. */


/* Bits [6..0] - Transfer size */
//#define OTG_HS_XFRSIZ_MSK (((1 << (6 - 0 + 1)) - 1) << 0)
//#define OTG_HS_XFRSIZ_SET(VAL) (((VAL) << 0) & OTG_HS_XFRSIZ_MSK)
//#define OTG_HS_XFRSIZ_GET(REG) (((REG) & OTG_HS_XFRSIZ_MSK) >> 0)
#define OTG_HS_XFRSIZ0_MSK (((1 << (6 - 0 + 1)) - 1) << 0)
#define OTG_HS_XFRSIZ0(VAL) (((VAL) << 0) & OTG_HS_XFRSIZ0_MSK)
#define OTG_HS_XFRSIZ0_GET(REG) (((REG) & OTG_HS_XFRSIZ0_MSK) >> 0)
/* Indicates the transfer size in bytes for endpoint 0. The core interrupts the application only after it has exhausted the transfer size amount of data. The transfer size can be set to the maximum packet size of the endpoint, to be interrupted at the end of each packet.
The core decrements this field every time a packet from the external memory is written to the TxFIFO. */


/* OTG_HS device OUT endpoint 0 transfer size register */
#define STM32F_OTG_HS_DOEPTSIZ0 0xB10

/* The application must modify this register before enabling endpoint 0. Once endpoint 0 is enabled using the Endpoint enable bit in the device control endpoint 0 control registers (EPENA bit in OTG_HS_DOEPCTL0), the core modifies this register. The application can only read this register once the core has cleared the Endpoint enable bit.
Nonzero endpoints use the registers for endpoints 1–15. */

/* Bit 31 Reserved, must be kept at reset value. */


/* Bits [30..29] - SETUP packet count */
#define OTG_HS_STUPCNT_MSK (((1 << (30 - 29 + 1)) - 1) << 29)
#define OTG_HS_STUPCNT_SET(VAL) (((VAL) << 29) & OTG_HS_STUPCNT_MSK)
#define OTG_HS_STUPCNT_GET(REG) (((REG) & OTG_HS_STUPCNT_MSK) >> 29)
/* This field specifies the number of back-to-back SETUP data packets the endpoint can receive.
01: 1 packet
10: 2 packets
11: 3 packets */

/* [28..20] Reserved, must be kept at reset value. */


/* Bit 19 - Packet count */
//#define OTG_HS_PKTCNT (1 << 19)
#define OTG_HS_PKTCNT_MSK (((1 << (28 - 19 + 1)) - 1) << 19)
#define OTG_HS_PKTCNT_SET(VAL) (((VAL) << 19) & OTG_HS_PKTCNT_MSK)
#define OTG_HS_PKTCNT_GET(REG) (((REG) & OTG_HS_PKTCNT_MSK) >> 19)
/* This field is decremented to zero after a packet is written into the RxFIFO. */

/* [18..7] Reserved, must be kept at reset value. */


/* Bits [6..0] - Transfer size */
//#define OTG_HS_XFRSIZ_MSK (((1 << (6 - 0 + 1)) - 1) << 0)
//#define OTG_HS_XFRSIZ_SET(VAL) (((VAL) << 0) & OTG_HS_XFRSIZ_MSK)
//#define OTG_HS_XFRSIZ_GET(REG) (((REG) & OTG_HS_XFRSIZ_MSK) >> 0)
#define OTG_HS_XFRSIZ0_MSK (((1 << (6 - 0 + 1)) - 1) << 0)
#define OTG_HS_XFRSIZ0(VAL) (((VAL) << 0) & OTG_HS_XFRSIZ0_MSK)
#define OTG_HS_XFRSIZ0_GET(REG) (((REG) & OTG_HS_XFRSIZ0_MSK) >> 0)
/* Indicates the transfer size in bytes for endpoint 0. The core interrupts the application only after it has exhausted the transfer size amount of data. The transfer size can be set to the maximum packet size of the endpoint, to be interrupted at the end of each packet.
The core decrements this field every time a packet is read from the RxFIFO and written to the external memory. */

/* OTG_HS device endpoint-x transfer size register (OTG_HS_DIEPTSIZx)
(x = 1..3, where x = Endpoint_number)
Address offset: 0x910 + (Endpoint_number × 0x20) */
/* The application must modify this register before enabling the endpoint. Once the endpoint is enabled using the Endpoint enable bit in the device endpoint-x control registers (EPENA bit in OTG_HS_DIEPCTLx), the core modifies this register. The application can only read this register once the core has cleared the Endpoint enable bit. */

