bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
/* Bit 31 Reserved, must be kept at reset value. */


/* Bits [30..29] - Multi count */
#define OTG_HS_MCNT_MSK (((1 << (30 - 29 + 1)) - 1) << 29)
#define OTG_HS_MCNT_SET(VAL) (((VAL) << 29) & OTG_HS_MCNT_MSK)
#define OTG_HS_MCNT_GET(REG) (((REG) & OTG_HS_MCNT_MSK) >> 29)
/* For periodic IN endpoints, this field indicates the number of packets that must be transmitted per frame on the USB. The core uses this field to calculate the data PID for isochronous IN
endpoints.
01: 1 packet
10: 2 packets
11: 3 packets */

/* Bits [28..19] - Packet count */
#define OTG_HS_PKTCNT_MSK (((1 << (28 - 19 + 1)) - 1) << 19)
#define OTG_HS_PKTCNT_SET(VAL) (((VAL) << 19) & OTG_HS_PKTCNT_MSK)
#define OTG_HS_PKTCNT_GET(REG) (((REG) & OTG_HS_PKTCNT_MSK) >> 19)
/* Indicates the total number of USB packets that constitute the Transfer Size amount of data for this endpoint.
This field is decremented every time a packet (maximum size or short packet) is read from the TxFIFO. */

/* Bits [18..0] - Transfer size */
#define OTG_HS_XFRSIZ_MSK (((1 << (18 - 0 + 1)) - 1) << 0)
#define OTG_HS_XFRSIZ_SET(VAL) (((VAL) << 0) & OTG_HS_XFRSIZ_MSK)
#define OTG_HS_XFRSIZ_GET(REG) (((REG) & OTG_HS_XFRSIZ_MSK) >> 0)
/* This field contains the transfer size in bytes for the current endpoint. The core only interrupts the application after it has exhausted the transfer size amount of data. The transfer size can be set to the maximum packet size of the endpoint, to be interrupted at the end of each packet.
The core decrements this field every time a packet from the external memory is written to the TxFIFO. */

/* OTG_HS device IN endpoint transmit FIFO status register (OTG_HS_DTXFSTSx) (x = 0..5, where x = Endpoint_number)
Address offset for IN endpoints: 0x918 + (Endpoint_number × 0x20)  */
/* This read-only register contains the free space information for the Device IN endpoint TxFIFO. */
/* 31:16 Reserved, must be kept at reset value.
15:0 INEPTFSAV: IN endpoint TxFIFO space avail ()
Indicates the amount of free space available in the Endpoint TxFIFO.
Values are in terms of 32-bit words:
0x0: Endpoint TxFIFO is full
0x1: 1 word available
0x2: 2 words available
0xn: n words available (0 < n < 512)
Others: Reserved */


/* OTG_HS device endpoint-x transfer size register */
#define STM32F_OTG_HS_DOEPTSIZX 0xB10

/* The application must modify this register before enabling the endpoint. Once the endpoint is enabled using Endpoint Enable bit of the device endpoint-x control registers (EPENA bit in OTG_HS_DOEPCTLx), the core modifies this register. The application can only read this register once the core has cleared the Endpoint enable bit. */

/* Bit 31 Reserved, must be kept at reset value. */


/* Bits [30..29] - Received data PID */
#define OTG_HS_RXDPID_MSK (((1 << (30 - 29 + 1)) - 1) << 29)
#define OTG_HS_RXDPID_SET(VAL) (((VAL) << 29) & OTG_HS_RXDPID_MSK)
#define OTG_HS_RXDPID_GET(REG) (((REG) & OTG_HS_RXDPID_MSK) >> 29)
/* Applies to isochronous OUT endpoints only.
This is the data PID received in the last packet for this endpoint.
00: DATA0
01: DATA2
10: DATA1
11: MDATA
STUPCNT: SETUP packet count
Applies to control OUT Endpoints only.
This field specifies the number of back-to-back SETUP data packets the endpoint can receive.
01: 1 packet
10: 2 packets
11: 3 packets */

/* Bits [28..19] - Packet count */
#define OTG_HS_PKTCNT_MSK (((1 << (28 - 19 + 1)) - 1) << 19)
#define OTG_HS_PKTCNT_SET(VAL) (((VAL) << 19) & OTG_HS_PKTCNT_MSK)
#define OTG_HS_PKTCNT_GET(REG) (((REG) & OTG_HS_PKTCNT_MSK) >> 19)
/* Indicates the total number of USB packets that constitute the Transfer Size amount of data for this endpoint.
This field is decremented every time a packet (maximum size or short packet) is written to the RxFIFO. */

/* Bits [18..0] - Transfer size */
#define OTG_HS_XFRSIZ_MSK (((1 << (18 - 0 + 1)) - 1) << 0)
#define OTG_HS_XFRSIZ_SET(VAL) (((VAL) << 0) & OTG_HS_XFRSIZ_MSK)
#define OTG_HS_XFRSIZ_GET(REG) (((REG) & OTG_HS_XFRSIZ_MSK) >> 0)
/* This field contains the transfer size in bytes for the current endpoint. The core only interrupts the application after it has exhausted the transfer size amount of data. The transfer size can be set to the maximum packet size of the endpoint, to be interrupted at the end of each packet.
The core decrements this field every time a packet is read from the RxFIFO and written to the external memory. */



/* OTG_HS device endpoint-x DMA address register (OTG_HS_DIEPDMAx / OTG_HS_DOEPDMAx) (x = 1..5, where x = Endpoint_number)
Address offset for IN endpoints: 0x914 + (Endpoint_number × 0x20)
Address offset for OUT endpoints: 0xB14 + (Endpoint_number × 0x20) */

/* Bits [31..0] - DMA address */
#define OTG_HS_DMAADDR_MSK (((1 << (31 - 0 + 1)) - 1) << 0)
#define OTG_HS_DMAADDR_SET(VAL) (((VAL) << 0) & OTG_HS_DMAADDR_MSK)
#define OTG_HS_DMAADDR_GET(REG) (((REG) & OTG_HS_DMAADDR_MSK) >> 0)
/* This bit holds the start address of the external memory for storing or fetching endpoint data.
Note: For control endpoints, this field stores control OUT data packets as well as SETUP transaction data packets. When more than three SETUP packets are received back-to-back, the SETUP data packet in the memory is overwritten. This register is incremented on every AHB transaction. The application can give only a DWORD-aligned address. */


/* OTG_HS power and clock gating control register */
#define STM32F_OTG_HS_PCGCCTL 0xE00

/* This register is available in host and peripheral modes. */

/* [31..5] Reserved, must be kept at reset value. */


/* Bit 4 - PHY suspended */
#define OTG_HS_PHYSUSP (1 << 4)
/* Indicates that the PHY has been suspended. This bit is updated once the PHY is suspended after the application has set the STPPCLK bit (bit 0). */

/* [3..2] Reserved, must be kept at reset value. */


/* Bit 1 - Gate HCLK */
#define OTG_HS_GATEHCLK (1 << 1)
/* The application sets this bit to gate HCLK to modules other than the AHB Slave and Master and wakeup logic when the USB is suspended or the session is not valid. The application clears this bit when the USB is resumed or a new session starts. */

/* Bit 0 - Stop PHY clock */
#define OTG_HS_STPPCLK (1 << 0)
/* The application sets this bit to stop the PHY clock when the USB is suspended, the session is not valid, or the device is disconnected. The application clears this bit when the USB is resumed or a new session starts. */

#define STM32F_OTG_HS_RAM_SIZE (4096)

