bobmittmann/thinkos/sdk/include/stm32f/stm32f-otg_hs.h
#ifndef __ASSEMBLER__

#include <stdint.h>
#include <stdbool.h>

struct stm32f_otg_hs {
	/* 0x000 */
	volatile uint32_t gotgctl;
	volatile uint32_t gotgint;
	volatile uint32_t gahbcfg;
	volatile uint32_t gusbcfg;
	/* 0x010 */
	volatile uint32_t grstctl;
	volatile uint32_t gintsts;
	volatile uint32_t gintmsk;
	volatile uint32_t grxstsr;
	/* 0x020 */
	volatile uint32_t grxstsp;
	volatile uint32_t grxfsiz;
	union {
		volatile uint32_t hnptxfsiz;
		volatile uint32_t dieptxf0;
	};
	volatile uint32_t hnptxsts;
	/* 0x030 */
	volatile uint32_t gi2cctl;
	uint32_t res1;
	volatile uint32_t gccfg;
	volatile uint32_t cid;
	/* 0x040 */
	uint32_t res2[(0x100 - 0x040) / 4];
	/* 0x100 */
	volatile uint32_t hptxfsiz;
	volatile uint32_t dieptxf1;
	volatile uint32_t dieptxf2;
	volatile uint32_t dieptxf3;
	volatile uint32_t dieptxf4;
	/* 0x110 */
	uint32_t res3[(0x400 - 0x114) / 4];
	/* 0x400 */
	volatile uint32_t hcfg;
	volatile uint32_t hfir;
	volatile uint32_t hfnum;
	uint32_t res4;
	/* 0x410 */
	volatile uint32_t hptxsts;
	volatile uint32_t haint;
	volatile uint32_t haintmsk;
	/* 0x41c */
	uint32_t res5[(0x440 - 0x41c) / 4];
	/* 0x440 */
	volatile uint32_t hptr;
	/* 0x444 */
	uint32_t res6[(0x500 - 0x444) / 4];
	/* 0x500 */
	struct {
		volatile uint32_t hcchar; /* 0x500, 0x520 ... */
		uint32_t res1;    /* 0x504 */
		volatile uint32_t hcint;    /* 0x508 */
		volatile uint32_t hcintmsk; /* 0x50c */
		volatile uint32_t hctsiz;   /* 0x510 */
		volatile uint32_t hctdma;   /* 0x514 */
		uint32_t res2[2]; /* 0x518 */
	} hc[12];
	/* 0x600 */
	uint32_t res7[(0x800 - 0x680) / 4];
	/* 0x800 */
	volatile uint32_t dcfg;
	volatile uint32_t dctl;
	volatile uint32_t dsts;
	uint32_t res8;
	/* 0x810 */
	volatile uint32_t diepmsk;
	volatile uint32_t doepmsk;
	volatile uint32_t daint;
	volatile uint32_t daintmsk;
	/* 0x820 */
	uint32_t res9[2];
	/* 0x828 */
	volatile uint32_t dvbusdis;
	volatile uint32_t dvbuspulse;
	/* 0x830 */
	volatile uint32_t dthrctl;
	volatile uint32_t diepempmsk;
	volatile uint32_t deachint;
	volatile uint32_t deachintmsk;
	/* 0x840 */
	uint32_t res10;
	volatile uint32_t diepeachmsk1;
	uint32_t res11[(0x884 - 0x848) / 4];
	/* 0x884 */
	volatile uint32_t doepeachmsk1;
	uint32_t res12[(0x900 - 0x888) / 4];
	/* 0x900 */
	struct {
		volatile uint32_t diepctl; /* 0x900, 0x920, 0x940, 0x960,
									  0x980, 0x9a0, 0x9c0, 0x9e0 */
		uint32_t res1;
		volatile uint32_t diepint; /* 0x908 .. */
		uint32_t res2;
		volatile uint32_t dieptsiz; /* 0x910 ... */
		volatile uint32_t diepdma; /* 0x914 ...  */
		volatile uint32_t dtxfsts; /* 0x918, 0x938, 0x958, 0x978 ... */
		uint32_t res4;
	} inep[8];
	/* 0xa00 */
	uint32_t res13[(0xb00 - 0xa00) / 4];
	struct {
		volatile uint32_t doepctl; /* 0xb00, 0xb20, 0xb40, 0xb60 ... */
		uint32_t res1;
		volatile uint32_t doepint; /* 0xb08, 0xb28, 0xb48, 0xb68 ... */
		uint32_t res2;
		volatile uint32_t doeptsiz; /* 0xb10, 0xb30, 0xb50, 0xb70 ... */
		volatile uint32_t doepdma; /* 0xb14, 0xb34, 0xb54, 0xb74 ... */
		uint32_t res3[2];
	} outep[8];
	/* 0xb80 */
	uint32_t res14[(0xe00 - 0xb80) / 4];
	/* 0xe00 */
	volatile uint32_t pcgcctl;
	/* 0xe04 */
	uint32_t res15[(0x1000 - 0xe04) / 4];
	/* 0x1000 */
	struct {
		union {
			volatile uint32_t pop;
			volatile uint32_t push;
		};
		uint32_t res1[(0x1000 - 4) / 4];
	} dfifo[8];
	uint32_t res16[(0x20000 - (0x1000 + (8 * 0x1000))) / 4];
	/* 0x20000 */
	uint32_t ram[32768];
};

extern const uint8_t stm32f_otg_hs_ep0_mpsiz_lut[];

#define OTG_HS_EP0_MPSIZ_GET(DEPCTL) \
	stm32f_otg_hs_ep0_mpsiz_lut[OTG_HS_MPSIZ_GET(DEPCTL)]

#define OTG_HS_EP0_MPSIZ_SET(MPSIZ) ((MPSIZ == 64) ? OTG_HS_MPSIZ_64 : \
		((MPSIZ == 32) ? OTG_HS_MPSIZ_32 : \
		((MPSIZ == 16) ? OTG_HS_MPSIZ_16 : OTG_HS_MPSIZ_8)))

#ifdef __cplusplus
extern "C" {
#endif

void stm32f_otg_hs_core_reset(struct stm32f_otg_hs * otg_hs);

void stm32f_otg_hs_device_init(struct stm32f_otg_hs * otg_hs);

void stm32f_otg_hs_txfifo_flush(struct stm32f_otg_hs * otg_hs,
								unsigned int num);

void stm32f_otg_hs_rxfifo_flush(struct stm32f_otg_hs * otg_hs);

void stm32f_otg_hs_addr_set(struct stm32f_otg_hs * otg_hs, unsigned int addr);

void stm32f_otg_hs_ep_disable(struct stm32f_otg_hs * otg_hs, unsigned int addr);

void stm32f_otg_hs_ep_dump(struct stm32f_otg_hs * otg_hs, unsigned int addr);

void stm32f_otg_hs_ep_enable(struct stm32f_otg_hs * otg_hs, unsigned int addr,
							 unsigned int type, unsigned int mpsiz);

/* prepare TX fifo to send */
int stm32f_otg_hs_txf_setup(struct stm32f_otg_hs * otg_hs, unsigned int ep,
							 unsigned int len);

/* push data inot TX fifo */
int stm32f_otg_hs_txf_push(struct stm32f_otg_hs * otg_hs, unsigned int ep,
						   void * buf);

void stm32f_otg_hs_enum_done(struct stm32f_otg_hs * otg_hs);

#ifdef __cplusplus
}
#endif


#endif /* __ASSEMBLER__ */

#endif /* __STM32F_OTG_HS_H__ */
